zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_hal_rif.h
/**
  ******************************************************************************
  * @file    stm32mp2xx_hal_rif.h
  * @author  MCD Application Team
  * @brief   Header file of RIF HAL module.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2020 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef STM32MP2xx_HAL_RIF_H
#define STM32MP2xx_HAL_RIF_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32mp2xx_hal_def.h"


/** @addtogroup STM32MP2xx_HAL_Driver
  * @{
  */

/** @addtogroup RIF
  * @{
  */

/* Exported types ------------------------------------------------------------*/
/** @defgroup RIF_Exported_Types RIF Exported Types
  * @{
  */
typedef struct
{
  uint32_t PeriphId;
  uint32_t SecEnable;
  uint32_t PrivEnable;
  uint32_t CidEnable;
  uint32_t SemEnable;
  uint32_t Scid;
  uint32_t SemWl;
  uint32_t LockEnable;
} RIF_Periph_Desc;

#if defined(LPSRAM1_BASE) && defined(LPSRAM2_BASE) && defined(LPSRAM3_BASE)
typedef struct
{
  uint32_t Instance;
  uint32_t SubRegId;
  uint32_t SecEnable;
  uint32_t PrivEnable;
  uint32_t SubRegEnable;
  uint32_t Srcid;
  uint32_t SubRegStart;
  uint32_t SubRegLength;
  uint32_t LockEnable;
} RIF_MemRisal_Desc;

#endif /* LPSRAM1_BASE && LPSRAM2_BASE && LPSRAM3_BASE */
typedef struct
{
  uint32_t TDcid;
  uint32_t DAPcid;
} RIF_RIMC_TrustedDesc;

typedef struct
{
  uint32_t MasterId;
  uint32_t SecEnable;
  uint32_t PrivEnable;
  uint32_t CidEnable;
  uint32_t Mcid;
} RIF_RIMC_MasterDesc;

typedef struct
{
  uint32_t Instance;
  uint32_t SecAccessEnable;
  uint32_t PageSecEnable;
  uint32_t PagePrivEnable;
  uint32_t Cid;
  uint32_t CidPageEnable;
  uint32_t C2PagePrivEnable;
  uint32_t CidPagePrivEnable;
  uint32_t CidPageReadEnable;
  uint32_t CidPageWriteEnable;
  uint32_t DccidPageEnable;
  uint32_t Dccid;
  uint32_t PageLockEnable;
} RIF_MemRisab_Desc;

typedef struct
{
  uint32_t Instance;
  uint32_t RegEnable;
  uint32_t RegSecEnable;
  uint32_t RegEncEnable;
  uint32_t CidRegPriv;
  uint32_t CidRegRead;
  uint32_t CidRegWrite;
  uint32_t RegAddress;
  uint32_t RegSize;
} RIF_MemRisafReg_Desc;

typedef struct
{
  uint32_t Instance;
  uint32_t SubRegId;
  uint32_t SubRegEnable;
  uint32_t SubRegSecEnable;
  uint32_t SubRegPrivEnable;
  uint32_t SubRegReadEnable;
  uint32_t SubRegWriteEnable;
  uint32_t SubRegDCidEnable;
  uint32_t SubRegDccid;
  uint32_t SubRegSrcid;
  uint32_t SubRegAddress;
  uint32_t SubRegSize;
  uint32_t SubRegLockEnable;
} RIF_MemRisafSubReg_Desc;

typedef struct
{
  uint32_t Instance;
  uint32_t Key0;
  uint32_t Key1;
  uint32_t Key2;
  uint32_t Key3;
} RIF_MemRisafEncKey_Desc;
/**
  * @}
  */

/* Private constants ---------------------------------------------------------*/

/** @defgroup RIF_Private_Constants RIF Private Constants
  * @{
  */

/**
  * @brief  RIF structure definitions for IP identifier parameter (PeriphId)
  *         used in HAL_RISC_ConfigPeriphAttributes and
  *         HAL_RISC_GetConfigPeriphAttributes functions and also in all
  *         HAL_IAC related functions bitmap:
  *         bits[31:28] Field "register". Define the register an IP belongs to.
  *                     Each bit is dedicated to a single register.
  *         bit[5]      Field "all Ips". If this bit is set then the PeriphId
  *                     targets all Ips within register.
  *         bits[4:0]   Field "bit position". Define the bit position within
  *                     the register dedicated to the IP, value from 0 to 31.
  */

#define RIF_PERIPH_REG_Pos             (28U)
#define RIF_PERIPH_REG_Msk             (0xFUL << RIF_PERIPH_REG_Pos)      /*0xF0000000*/
#define RIF_PERIPH_REG0                (0x0UL << RIF_PERIPH_REG_Pos)      /*0x00000000*/
#define RIF_PERIPH_REG1                (0x1UL << RIF_PERIPH_REG_Pos)      /*0x10000000*/
#define RIF_PERIPH_REG2                (0x2UL << RIF_PERIPH_REG_Pos)      /*0x20000000*/
#define RIF_PERIPH_REG3                (0x3UL << RIF_PERIPH_REG_Pos)      /*0x30000000*/
#define RIF_PERIPH_REG4                (0x4UL << RIF_PERIPH_REG_Pos)      /*0x40000000*/
#define RIF_PERIPH_REG5                (0x5UL << RIF_PERIPH_REG_Pos)      /*0x50000000*/
#define RIF_PERIPH_ALLIP_Pos           (5U)
#define RIF_PERIPH_ALLIP_Msk           (0x1UL << RIF_PERIPH_ALLIP_Pos)    /*0x00000020*/
#define RIF_PERIPH_BITPOS_Pos          (0U)
#define RIF_PERIPH_BITPOS_Msk          (0x1FUL << RIF_PERIPH_BITPOS_Pos)  /*0x0000001F*/

/**
  * @brief RIF attribute mask and position definition
  */
#define RIF_ATTRIBUTE_SEC_Pos          (0U)
#define RIF_ATTRIBUTE_SEC_Msk          (0x1U << RIF_ATTRIBUTE_SEC_Pos)
#define RIF_ATTRIBUTE_PRIV_Pos         (1U)
#define RIF_ATTRIBUTE_PRIV_Msk         (0x1U << RIF_ATTRIBUTE_PRIV_Pos)

/**
  * @}
  */

/* Exported constants --------------------------------------------------------*/

/** @defgroup RIF_Exported_Constants RIF Exported Constants
  * @{
  */

/* Definitions for RIF register values and constants */
#define RIF_PERIPH_REG_MAX             (6U)
#define RIF_COMP_MAX                   (8U)
#define RIF_CID_MAX                    (7U)
#define RIF_PAGE_MAX                   (32U)
#define RIF_BLOCK_MAX                  (8U)
#define RIF_MCID_MAX                   (15U)
#define RIF_REGION_MAX                 (15U)
#define RIF_SUBREGION_MAX              (2U)
#define RIF_KEY_REG_MAX                (4U)
#define RISAF1_BASE_REGION_MAX         (4U)
#define RISAF2_BASE_REGION_MAX         (4U)
#define RISAF4_BASE_REGION_MAX         (15U)
#define RISAF5_BASE_REGION_MAX         (2U)
#define RISAF1_WATERMARK_MAX           (256U)
#define RISAF2_WATERMARK_MAX           (4096U)
#define RISAF4_WATERMARK_MAX           (4096U)
#define RISAF5_WATERMARK_MAX           (4096U)
#define RIF_REG_ALL_Msk                (0xFFFFFFFFUL)
#define RISC_PERIPH_REG0_ALL_Msk       (0xFFFFFFFFUL)
#if defined(USE_UART4)
#define RISC_PERIPH_REG1_ALL_Msk       (0xBFDFFFFBUL)
#else
#define RISC_PERIPH_REG1_ALL_Msk       (0xBFDFFFFFUL)
#endif /* defined(USE_UART4) */
#define RISC_PERIPH_REG2_ALL_Msk       (0xF7D3FDFCUL)
#define RISC_PERIPH_REG3_ALL_Msk       (0x0FFDFDFFUL)
#define RISC_PERIPH_REG4_ALL_Msk       (0x00000000UL)
#define RISC_PERIPH_REG5_ALL_Msk       (0x00000000UL)

