zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_hal_rif.h
/** @defgroup RIF_Attribute RIF Attribute
  *           bitmap: bit0 : Sec Attr (0 = Ns, 1 = Sec)
  *                   bit1 : PrivAttr (0 = NonPriv, 1 = Priv)
  * @{
  */
#define RIF_ATTRIBUTE_SEC              RIF_ATTRIBUTE_SEC_Msk
#define RIF_ATTRIBUTE_NSEC             (0U)
#define RIF_ATTRIBUTE_PRIV             RIF_ATTRIBUTE_PRIV_Msk
#define RIF_ATTRIBUTE_NPRIV            (0U)

/**
  * @}
  */


/** @defgroup RIF_Peripheral_Identification RIF Peripheral Identification
  *           user-oriented definition for each IP identifier parameter (PeriphId)
  *           used in HAL_RISC_ConfigPeriphAttributes and HAL_RISC_GetConfigPeriphAttributes
  *           functions and also in all HAL_IAC relative functions.
  * @note     user can also select all IPs using specific define
  * @note     that two maximum values are also defined here:
  *           - max number of securable AHB/APB peripherals or masters (used in
  *           RISC sub-block)
  *           - max number of securable and TrustZone-aware AHB/APB peripherals
  *           or masters (used in IAC sub-block)
  * @{
  */
#define RIF_PERIPH_TIM1                (RIF_PERIPH_REG0 | RISC_SECCFGR0_SEC0_Pos)
#define RIF_PERIPH_TIM2                (RIF_PERIPH_REG0 | RISC_SECCFGR0_SEC1_Pos)
#define RIF_PERIPH_TIM3                (RIF_PERIPH_REG0 | RISC_SECCFGR0_SEC2_Pos)
#define RIF_PERIPH_TIM4                (RIF_PERIPH_REG0 | RISC_SECCFGR0_SEC3_Pos)
#define RIF_PERIPH_TIM5                (RIF_PERIPH_REG0 | RISC_SECCFGR0_SEC4_Pos)
#define RIF_PERIPH_TIM6                (RIF_PERIPH_REG0 | RISC_SECCFGR0_SEC5_Pos)
#define RIF_PERIPH_TIM7                (RIF_PERIPH_REG0 | RISC_SECCFGR0_SEC6_Pos)
#define RIF_PERIPH_TIM8                (RIF_PERIPH_REG0 | RISC_SECCFGR0_SEC7_Pos)
#define RIF_PERIPH_TIM10               (RIF_PERIPH_REG0 | RISC_SECCFGR0_SEC8_Pos)
#define RIF_PERIPH_TIM11               (RIF_PERIPH_REG0 | RISC_SECCFGR0_SEC9_Pos)
#define RIF_PERIPH_TIM12               (RIF_PERIPH_REG0 | RISC_SECCFGR0_SEC10_Pos)
#define RIF_PERIPH_TIM13               (RIF_PERIPH_REG0 | RISC_SECCFGR0_SEC11_Pos)
#define RIF_PERIPH_TIM14               (RIF_PERIPH_REG0 | RISC_SECCFGR0_SEC12_Pos)
#define RIF_PERIPH_TIM15               (RIF_PERIPH_REG0 | RISC_SECCFGR0_SEC13_Pos)
#define RIF_PERIPH_TIM16               (RIF_PERIPH_REG0 | RISC_SECCFGR0_SEC14_Pos)
#define RIF_PERIPH_TIM17               (RIF_PERIPH_REG0 | RISC_SECCFGR0_SEC15_Pos)
#if defined(TIM20)
#define RIF_PERIPH_TIM20               (RIF_PERIPH_REG0 | RISC_SECCFGR0_SEC16_Pos)
#endif /* TIM20 */
#define RIF_PERIPH_LPTIM1              (RIF_PERIPH_REG0 | RISC_SECCFGR0_SEC17_Pos)
#define RIF_PERIPH_LPTIM2              (RIF_PERIPH_REG0 | RISC_SECCFGR0_SEC18_Pos)
#define RIF_PERIPH_LPTIM3              (RIF_PERIPH_REG0 | RISC_SECCFGR0_SEC19_Pos)
#define RIF_PERIPH_LPTIM4              (RIF_PERIPH_REG0 | RISC_SECCFGR0_SEC20_Pos)
#define RIF_PERIPH_LPTIM5              (RIF_PERIPH_REG0 | RISC_SECCFGR0_SEC21_Pos)
#define RIF_PERIPH_SPI1                (RIF_PERIPH_REG0 | RISC_SECCFGR0_SEC22_Pos)
#define RIF_PERIPH_SPI2                (RIF_PERIPH_REG0 | RISC_SECCFGR0_SEC23_Pos)
#define RIF_PERIPH_SPI3                (RIF_PERIPH_REG0 | RISC_SECCFGR0_SEC24_Pos)
#define RIF_PERIPH_SPI4                (RIF_PERIPH_REG0 | RISC_SECCFGR0_SEC25_Pos)
#define RIF_PERIPH_SPI5                (RIF_PERIPH_REG0 | RISC_SECCFGR0_SEC26_Pos)
#if defined(SPI6)
#define RIF_PERIPH_SPI6                (RIF_PERIPH_REG0 | RISC_SECCFGR0_SEC27_Pos)
#endif /* SPI6 */
#if defined(SPI7)
#define RIF_PERIPH_SPI7                (RIF_PERIPH_REG0 | RISC_SECCFGR0_SEC28_Pos)
#endif /* SPI7 */
#if defined(SPI8)
#define RIF_PERIPH_SPI8                (RIF_PERIPH_REG0 | RISC_SECCFGR0_SEC29_Pos)
#endif /* SPI8 */
#define RIF_PERIPH_SPDIFRX             (RIF_PERIPH_REG0 | RISC_SECCFGR0_SEC30_Pos)
#define RIF_PERIPH_USART1              (RIF_PERIPH_REG0 | RISC_SECCFGR0_SEC31_Pos)

#define RIF_PERIPH_USART2              (RIF_PERIPH_REG1 | RISC_SECCFGR1_SEC32_Pos)
#define RIF_PERIPH_USART3              (RIF_PERIPH_REG1 | RISC_SECCFGR1_SEC33_Pos)
#define RIF_PERIPH_UART4               (RIF_PERIPH_REG1 | RISC_SECCFGR1_SEC34_Pos)
#define RIF_PERIPH_UART5               (RIF_PERIPH_REG1 | RISC_SECCFGR1_SEC35_Pos)
#define RIF_PERIPH_USART6              (RIF_PERIPH_REG1 | RISC_SECCFGR1_SEC36_Pos)
#define RIF_PERIPH_UART7               (RIF_PERIPH_REG1 | RISC_SECCFGR1_SEC37_Pos)
#if defined(UART8)
#define RIF_PERIPH_UART8               (RIF_PERIPH_REG1 | RISC_SECCFGR1_SEC38_Pos)
#endif /* UART8 */
#if defined(UART9)
#define RIF_PERIPH_UART9               (RIF_PERIPH_REG1 | RISC_SECCFGR1_SEC39_Pos)
#endif /* UART9 */
#define RIF_PERIPH_LPUART1             (RIF_PERIPH_REG1 | RISC_SECCFGR1_SEC40_Pos)
#define RIF_PERIPH_I2C1                (RIF_PERIPH_REG1 | RISC_SECCFGR1_SEC41_Pos)
#define RIF_PERIPH_I2C2                (RIF_PERIPH_REG1 | RISC_SECCFGR1_SEC42_Pos)
#if defined(I2C3)
#define RIF_PERIPH_I2C3                (RIF_PERIPH_REG1 | RISC_SECCFGR1_SEC43_Pos)
#endif /* I2C3 */
#if defined(I2C4)
#define RIF_PERIPH_I2C4                (RIF_PERIPH_REG1 | RISC_SECCFGR1_SEC44_Pos)
#endif /* I2C4 */
#if defined(I2C5)
#define RIF_PERIPH_I2C5                (RIF_PERIPH_REG1 | RISC_SECCFGR1_SEC45_Pos)
#endif /* I2C5 */
#if defined(I2C6)
#define RIF_PERIPH_I2C6                (RIF_PERIPH_REG1 | RISC_SECCFGR1_SEC46_Pos)
#endif /* I2C6 */
#if defined(I2C7)
#define RIF_PERIPH_I2C7                (RIF_PERIPH_REG1 | RISC_SECCFGR1_SEC47_Pos)
#endif /* I2C7 */
#if defined(I2C8)
#define RIF_PERIPH_I2C8                (RIF_PERIPH_REG1 | RISC_SECCFGR1_SEC48_Pos)
#endif /* I2C8 */
#define RIF_PERIPH_SAI1                (RIF_PERIPH_REG1 | RISC_SECCFGR1_SEC49_Pos)
#define RIF_PERIPH_SAI2                (RIF_PERIPH_REG1 | RISC_SECCFGR1_SEC50_Pos)
#define RIF_PERIPH_SAI3                (RIF_PERIPH_REG1 | RISC_SECCFGR1_SEC51_Pos)
#define RIF_PERIPH_SAI4                (RIF_PERIPH_REG1 | RISC_SECCFGR1_SEC52_Pos)
#define RIF_PERIPH_RES53               (RIF_PERIPH_REG1 | RISC_SECCFGR1_SEC53_Pos)
#define RIF_PERIPH_MDF1                (RIF_PERIPH_REG1 | RISC_SECCFGR1_SEC54_Pos)
#if defined(ADF1)
#define RIF_PERIPH_ADF1                (RIF_PERIPH_REG1 | RISC_SECCFGR1_SEC55_Pos)
#endif /* ADF1 */
#define RIF_PERIPH_FDCAN               (RIF_PERIPH_REG1 | RISC_SECCFGR1_SEC56_Pos)
#define RIF_PERIPH_HDP                 (RIF_PERIPH_REG1 | RISC_SECCFGR1_SEC57_Pos)
#if defined(ADC12_COMMON)
#define RIF_PERIPH_ADC12               (RIF_PERIPH_REG1 | RISC_SECCFGR1_SEC58_Pos)
#define RIF_PERIPH_ADC3                (RIF_PERIPH_REG1 | RISC_SECCFGR1_SEC59_Pos)
#else
#define RIF_PERIPH_ADC1                (RIF_PERIPH_REG1 | RISC_SECCFGR1_SEC58_Pos)
#define RIF_PERIPH_ADC2                (RIF_PERIPH_REG1 | RISC_SECCFGR1_SEC59_Pos)
#endif /* ADC12_COMMON */
#define RIF_PERIPH_ETH1                (RIF_PERIPH_REG1 | RISC_SECCFGR1_SEC60_Pos)
#define RIF_PERIPH_ETH2                (RIF_PERIPH_REG1 | RISC_SECCFGR1_SEC61_Pos)
#define RIF_PERIPH_RES62               (RIF_PERIPH_REG1 | RISC_SECCFGR1_SEC62_Pos)
#define RIF_PERIPH_USBH                (RIF_PERIPH_REG1 | RISC_SECCFGR1_SEC63_Pos)

#define RIF_PERIPH_RES64               (RIF_PERIPH_REG2 | RISC_SECCFGR2_SEC64_Pos)
#define RIF_PERIPH_RES65               (RIF_PERIPH_REG2 | RISC_SECCFGR2_SEC65_Pos)
#if  ! defined(RIF_DERIVATIVE1_RESOURCES)
#define RIF_PERIPH_USB3DR              (RIF_PERIPH_REG2 | RISC_SECCFGR2_SEC66_Pos)
#define RIF_PERIPH_COMBOPHY            (RIF_PERIPH_REG2 | RISC_SECCFGR2_SEC67_Pos)
#else
#define RIF_PERIPH_OTG_HS              (RIF_PERIPH_REG2 | RISC_SECCFGR2_SEC66_Pos)
#define RIF_PERIPH_DDRPERFM            (RIF_PERIPH_REG2 | RISC_SECCFGR2_SEC67_Pos)
#endif /* RIF_DERIVATIVE1_RESOURCES */
#if defined(RISAF5)
#define RIF_PERIPH_PCIE                (RIF_PERIPH_REG2 | RISC_SECCFGR2_SEC68_Pos)
#endif /*RISAF5*/
#if defined(UCPD1)
#define RIF_PERIPH_UCPD1               (RIF_PERIPH_REG2 | RISC_SECCFGR2_SEC69_Pos)
#endif /* UCPD1 */
#if defined(ETHSW_DEIP)
#define RIF_PERIPH_ETHSW_DEIP          (RIF_PERIPH_REG2 | RISC_SECCFGR2_SEC70_Pos)
#endif /* ETHSW_DEIP */
#if defined(ETHSW_ACM)
#define RIF_PERIPH_ETHSW_ACM           (RIF_PERIPH_REG2 | RISC_SECCFGR2_SEC71_Pos)
#endif /* ETHSW_ACM */
#if defined(ETHSW_ACMMSG)
#define RIF_PERIPH_ETHSW_ACM_MSG       (RIF_PERIPH_REG2 | RISC_SECCFGR2_SEC72_Pos)
#endif /* ETHSW_ACM_MSG */
#define RIF_PERIPH_STGEN               (RIF_PERIPH_REG2 | RISC_SECCFGR2_SEC73_Pos)
#define RIF_PERIPH_OCTOSPI1            (RIF_PERIPH_REG2 | RISC_SECCFGR2_SEC74_Pos)
#if defined(OCTOSPI2)
#define RIF_PERIPH_OCTOSPI2            (RIF_PERIPH_REG2 | RISC_SECCFGR2_SEC75_Pos)
#endif /* OCTOSPI2 */
#define RIF_PERIPH_SDMMC1              (RIF_PERIPH_REG2 | RISC_SECCFGR2_SEC76_Pos)
#define RIF_PERIPH_SDMMC2              (RIF_PERIPH_REG2 | RISC_SECCFGR2_SEC77_Pos)
#define RIF_PERIPH_SDMMC3              (RIF_PERIPH_REG2 | RISC_SECCFGR2_SEC78_Pos)
#if defined(GPU)
#define RIF_PERIPH_GPU                 (RIF_PERIPH_REG2 | RISC_SECCFGR2_SEC79_Pos)
#endif /* GPU */
#define RIF_PERIPH_LTDC_CMN            (RIF_PERIPH_REG2 | RISC_SECCFGR2_SEC80_Pos)
#if defined(DSI)
#define RIF_PERIPH_DSI_CMN             (RIF_PERIPH_REG2 | RISC_SECCFGR2_SEC81_Pos)
#endif /* DSI */
#define RIF_PERIPH_RES82               (RIF_PERIPH_REG2 | RISC_SECCFGR2_SEC82_Pos)
#define RIF_PERIPH_RES83               (RIF_PERIPH_REG2 | RISC_SECCFGR2_SEC83_Pos)
#if defined(LVDS)
#define RIF_PERIPH_LDITX               (RIF_PERIPH_REG2 | RISC_SECCFGR2_SEC84_Pos)
#endif /* LVDS */
#define RIF_PERIPH_RES85               (RIF_PERIPH_REG2 | RISC_SECCFGR2_SEC85_Pos)
#define RIF_PERIPH_CSI2HOST            (RIF_PERIPH_REG2 | RISC_SECCFGR2_SEC86_Pos)
#define RIF_PERIPH_DCMIPP              (RIF_PERIPH_REG2 | RISC_SECCFGR2_SEC87_Pos)
#define RIF_PERIPH_DCMI_PSSI           (RIF_PERIPH_REG2 | RISC_SECCFGR2_SEC88_Pos)
#if defined(VDEC)
#define RIF_PERIPH_VDEC                (RIF_PERIPH_REG2 | RISC_SECCFGR2_SEC89_Pos)
#endif /* VDEC */
#if defined(VENC)
#define RIF_PERIPH_VENC                (RIF_PERIPH_REG2 | RISC_SECCFGR2_SEC90_Pos)
#endif /* VENC */
#define RIF_PERIPH_RES91               (RIF_PERIPH_REG2 | RISC_SECCFGR2_SEC91_Pos)
#if defined(RIF_DERIVATIVE1_RESOURCES)
#define RIF_PERIPH_RNG1                (RIF_PERIPH_REG2 | RISC_SECCFGR2_SEC92_Pos)
#define RIF_PERIPH_RNG2                (RIF_PERIPH_REG2 | RISC_SECCFGR2_SEC93_Pos)
#define RIF_PERIPH_PKA                 (RIF_PERIPH_REG2 | RISC_SECCFGR2_SEC94_Pos)
#define RIF_PERIPH_SAES                (RIF_PERIPH_REG2 | RISC_SECCFGR2_SEC95_Pos)
#define RIF_PERIPH_HASH1               (RIF_PERIPH_REG3 | RISC_SECCFGR3_SEC96_Pos)
#define RIF_PERIPH_HASH2               (RIF_PERIPH_REG3 | RISC_SECCFGR3_SEC97_Pos)

#define RIF_PERIPH_CRYP1               (RIF_PERIPH_REG3 | RISC_SECCFGR3_SEC98_Pos)
#define RIF_PERIPH_CRYP2               (RIF_PERIPH_REG3 | RISC_SECCFGR3_SEC99_Pos)
#define RIF_PERIPH_IWDG1               (RIF_PERIPH_REG3 | RISC_SECCFGR3_SEC100_Pos)
#define RIF_PERIPH_IWDG2               (RIF_PERIPH_REG3 | RISC_SECCFGR3_SEC101_Pos)
#define RIF_PERIPH_IWDG3               (RIF_PERIPH_REG3 | RISC_SECCFGR3_SEC102_Pos)
#define RIF_PERIPH_IWDG4               (RIF_PERIPH_REG3 | RISC_SECCFGR3_SEC103_Pos)
#define RIF_PERIPH_WWDG1               (RIF_PERIPH_REG3 | RISC_SECCFGR3_SEC104_Pos)
#elif defined(RIF_DERIVATIVE2_RESOURCES)
#define RIF_PERIPH_RNG                 (RIF_PERIPH_REG2 | RISC_SECCFGR2_SEC92_Pos)
#define RIF_PERIPH_PKA                 (RIF_PERIPH_REG2 | RISC_SECCFGR2_SEC93_Pos)
#define RIF_PERIPH_SAES                (RIF_PERIPH_REG2 | RISC_SECCFGR2_SEC94_Pos)
#define RIF_PERIPH_HASH                (RIF_PERIPH_REG2 | RISC_SECCFGR2_SEC95_Pos)

#define RIF_PERIPH_CRYP1               (RIF_PERIPH_REG3 | RISC_SECCFGR3_SEC96_Pos)
#define RIF_PERIPH_CRYP2               (RIF_PERIPH_REG3 | RISC_SECCFGR3_SEC97_Pos)
#define RIF_PERIPH_IWDG1               (RIF_PERIPH_REG3 | RISC_SECCFGR3_SEC98_Pos)
#define RIF_PERIPH_IWDG2               (RIF_PERIPH_REG3 | RISC_SECCFGR3_SEC99_Pos)
#define RIF_PERIPH_IWDG3               (RIF_PERIPH_REG3 | RISC_SECCFGR3_SEC100_Pos)
#define RIF_PERIPH_IWDG4               (RIF_PERIPH_REG3 | RISC_SECCFGR3_SEC101_Pos)
#define RIF_PERIPH_WWDG1               (RIF_PERIPH_REG3 | RISC_SECCFGR3_SEC103_Pos)
#else /* RIF_DERIVATIVE2_RESOURCES */
#define RIF_PERIPH_RNG                 (RIF_PERIPH_REG2 | RISC_SECCFGR2_SEC92_Pos)
#define RIF_PERIPH_PKA                 (RIF_PERIPH_REG2 | RISC_SECCFGR2_SEC93_Pos)
#define RIF_PERIPH_SAES                (RIF_PERIPH_REG2 | RISC_SECCFGR2_SEC94_Pos)
#define RIF_PERIPH_HASH                (RIF_PERIPH_REG2 | RISC_SECCFGR2_SEC95_Pos)

#define RIF_PERIPH_CRYP1               (RIF_PERIPH_REG3 | RISC_SECCFGR3_SEC96_Pos)
#define RIF_PERIPH_CRYP2               (RIF_PERIPH_REG3 | RISC_SECCFGR3_SEC97_Pos)
#define RIF_PERIPH_IWDG1               (RIF_PERIPH_REG3 | RISC_SECCFGR3_SEC98_Pos)
#define RIF_PERIPH_IWDG2               (RIF_PERIPH_REG3 | RISC_SECCFGR3_SEC99_Pos)
#define RIF_PERIPH_IWDG3               (RIF_PERIPH_REG3 | RISC_SECCFGR3_SEC100_Pos)
#define RIF_PERIPH_IWDG4               (RIF_PERIPH_REG3 | RISC_SECCFGR3_SEC101_Pos)
#define RIF_PERIPH_IWDG5               (RIF_PERIPH_REG3 | RISC_SECCFGR3_SEC102_Pos)
#define RIF_PERIPH_WWDG1               (RIF_PERIPH_REG3 | RISC_SECCFGR3_SEC103_Pos)
#define RIF_PERIPH_WWDG2               (RIF_PERIPH_REG3 | RISC_SECCFGR3_SEC104_Pos)
#endif /* RIF_DERIVATIVE1_RESOURCES */
#define RIF_PERIPH_RES105              (RIF_PERIPH_REG3 | RISC_SECCFGR3_SEC105_Pos)
#define RIF_PERIPH_VREFBUF             (RIF_PERIPH_REG3 | RISC_SECCFGR3_SEC106_Pos)
#define RIF_PERIPH_DTS                 (RIF_PERIPH_REG3 | RISC_SECCFGR3_SEC107_Pos)
#define RIF_PERIPH_RAMCFG              (RIF_PERIPH_REG3 | RISC_SECCFGR3_SEC108_Pos)
#define RIF_PERIPH_CRC                 (RIF_PERIPH_REG3 | RISC_SECCFGR3_SEC109_Pos)
#define RIF_PERIPH_SERC                (RIF_PERIPH_REG3 | RISC_SECCFGR3_SEC110_Pos)
#if defined(OCTOSPIM)
#define RIF_PERIPH_OCTOSPIM            (RIF_PERIPH_REG3 | RISC_SECCFGR3_SEC111_Pos)
#endif /* OCTOSPIM */
#if defined(GICV2M)
#define RIF_PERIPH_GICV2M              (RIF_PERIPH_REG3 | RISC_SECCFGR3_SEC112_Pos)
#endif /* GICV2M */
#define RIF_PERIPH_RES113              (RIF_PERIPH_REG3 | RISC_SECCFGR3_SEC113_Pos)
#define RIF_PERIPH_I3C1                (RIF_PERIPH_REG3 | RISC_SECCFGR3_SEC114_Pos)
#define RIF_PERIPH_I3C2                (RIF_PERIPH_REG3 | RISC_SECCFGR3_SEC115_Pos)
#if defined(I3C3)
#define RIF_PERIPH_I3C3                (RIF_PERIPH_REG3 | RISC_SECCFGR3_SEC116_Pos)
#endif /* I3C3 */
#if defined(I3C4)
#define RIF_PERIPH_I3C4                (RIF_PERIPH_REG3 | RISC_SECCFGR3_SEC117_Pos)
#endif /* I3C4 */
#define RIF_PERIPH_ICACHE_DCACHE       (RIF_PERIPH_REG3 | RISC_SECCFGR3_SEC118_Pos)
#define RIF_PERIPH_LTDC_L1L2           (RIF_PERIPH_REG3 | RISC_SECCFGR3_SEC119_Pos)
#define RIF_PERIPH_LTDC_L3             (RIF_PERIPH_REG3 | RISC_SECCFGR3_SEC120_Pos)
#if !defined(RIF_DERIVATIVE1_RESOURCES)
#define RIF_PERIPH_LTDC_ROT            (RIF_PERIPH_REG3 | RISC_SECCFGR3_SEC121_Pos)
#endif /* !RIF_DERIVATIVE1_RESOURCES  */
#if defined(DSI)
#define RIF_PERIPH_DSI_TRIG            (RIF_PERIPH_REG3 | RISC_SECCFGR3_SEC122_Pos)
#define RIF_PERIPH_DSI_RD              (RIF_PERIPH_REG3 | RISC_SECCFGR3_SEC123_Pos)
#endif /* DSI */
#define RIF_PERIPH_RES124              (RIF_PERIPH_REG3 | RISC_SECCFGR3_SEC124_Pos)
#if defined(OTFDEC1)
#define RIF_PERIPH_OTFDEC1             (RIF_PERIPH_REG3 | RISC_SECCFGR3_SEC125_Pos)
#endif /* OTFDEC1 */
#if defined(OTFDEC2)
#define RIF_PERIPH_OTFDEC2             (RIF_PERIPH_REG3 | RISC_SECCFGR3_SEC126_Pos)
#endif /* OTFDEC2 */
#define RIF_PERIPH_IAC                 (RIF_PERIPH_REG3 | RISC_SECCFGR3_SEC127_Pos)

