zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_hal_rif.h
#define RIF_PERIPH_RISAB1              (RIF_PERIPH_REG4 | RISC_SECCFGR4_SEC128_Pos)
#define RIF_PERIPH_RISAB2              (RIF_PERIPH_REG4 | RISC_SECCFGR4_SEC129_Pos)
#define RIF_PERIPH_RISAB3              (RIF_PERIPH_REG4 | RISC_SECCFGR4_SEC130_Pos)
#if defined(RISAB4)
#define RIF_PERIPH_RISAB4              (RIF_PERIPH_REG4 | RISC_SECCFGR4_SEC131_Pos)
#endif /* RISAB4 */
#define RIF_PERIPH_RISAB5              (RIF_PERIPH_REG4 | RISC_SECCFGR4_SEC132_Pos)
#if defined(RISAB6)
#define RIF_PERIPH_RISAB6              (RIF_PERIPH_REG4 | RISC_SECCFGR4_SEC133_Pos)
#endif /* RISAB6 */
#define RIF_PERIPH_RISAF1              (RIF_PERIPH_REG4 | RISC_SECCFGR4_SEC134_Pos)
#define RIF_PERIPH_RISAF2              (RIF_PERIPH_REG4 | RISC_SECCFGR4_SEC135_Pos)
#define RIF_PERIPH_RISAF3              (RIF_PERIPH_REG4 | RISC_SECCFGR4_SEC136_Pos)
#define RIF_PERIPH_RISAF4              (RIF_PERIPH_REG4 | RISC_SECCFGR4_SEC137_Pos)
#if defined(RISAF5)
#define RIF_PERIPH_RISAF5              (RIF_PERIPH_REG4 | RISC_SECCFGR4_SEC138_Pos)
#endif /* RISAF5 */
#if defined(LPSRAM1_BASE)
#define RIF_PERIPH_RISAL1              (RIF_PERIPH_REG4 | RISC_SECCFGR4_SEC139_Pos)
#endif /* LPSRAM1 */
#if defined(LPSRAM2_BASE)
#define RIF_PERIPH_RISAL2              (RIF_PERIPH_REG4 | RISC_SECCFGR4_SEC140_Pos)
#endif /*LPSRAM2*/
#if defined(LPSRAM3_BASE)
#define RIF_PERIPH_RISAL3              (RIF_PERIPH_REG4 | RISC_SECCFGR4_SEC141_Pos)
#endif /* LPSRAM3 */
#define RIF_PERIPH_RES142              (RIF_PERIPH_REG4 | RISC_SECCFGR4_SEC142_Pos)
#define RIF_PERIPH_RES143              (RIF_PERIPH_REG4 | RISC_SECCFGR4_SEC143_Pos)
#define RIF_PERIPH_IPCC1               (RIF_PERIPH_REG4 | RISC_SECCFGR4_SEC144_Pos)
#if defined(IPCC2)
#define RIF_PERIPH_IPCC2               (RIF_PERIPH_REG4 | RISC_SECCFGR4_SEC145_Pos)
#endif /* IPCC2 */
#if defined(HSEM)
#define RIF_PERIPH_HSEM                (RIF_PERIPH_REG4 | RISC_SECCFGR4_SEC146_Pos)
#endif /* HSEM */
#define RIF_PERIPH_HPDMA1              (RIF_PERIPH_REG4 | RISC_SECCFGR4_SEC147_Pos)
#define RIF_PERIPH_HPDMA2              (RIF_PERIPH_REG4 | RISC_SECCFGR4_SEC148_Pos)
#define RIF_PERIPH_HPDMA3              (RIF_PERIPH_REG4 | RISC_SECCFGR4_SEC149_Pos)
#if defined(LPDMA)
#define RIF_PERIPH_LPDMA               (RIF_PERIPH_REG4 | RISC_SECCFGR4_SEC150_Pos)
#endif /* LPDMA */
#define RIF_PERIPH_RTC                 (RIF_PERIPH_REG4 | RISC_SECCFGR4_SEC151_Pos)
#define RIF_PERIPH_TAMP                (RIF_PERIPH_REG4 | RISC_SECCFGR4_SEC152_Pos)
#define RIF_PERIPH_EXTI1               (RIF_PERIPH_REG4 | RISC_SECCFGR4_SEC153_Pos)
#define RIF_PERIPH_EXTI2               (RIF_PERIPH_REG4 | RISC_SECCFGR4_SEC154_Pos)
#define RIF_PERIPH_PWR                 (RIF_PERIPH_REG4 | RISC_SECCFGR4_SEC155_Pos)
#define RIF_PERIPH_RCC                 (RIF_PERIPH_REG4 | RISC_SECCFGR4_SEC156_Pos)
#define RIF_PERIPH_A35SSC              (RIF_PERIPH_REG4 | RISC_SECCFGR4_SEC157_Pos)
#define RIF_PERIPH_RISC_RIMC           (RIF_PERIPH_REG4 | RISC_SECCFGR4_SEC158_Pos)
#define RIF_PERIPH_SYSCFG              (RIF_PERIPH_REG4 | RISC_SECCFGR4_SEC159_Pos)

#define RIF_PERIPH_GPIOA               (RIF_PERIPH_REG5 | RISC_SECCFGR5_SEC160_Pos)
#define RIF_PERIPH_GPIOB               (RIF_PERIPH_REG5 | RISC_SECCFGR5_SEC161_Pos)
#define RIF_PERIPH_GPIOC               (RIF_PERIPH_REG5 | RISC_SECCFGR5_SEC162_Pos)
#define RIF_PERIPH_GPIOD               (RIF_PERIPH_REG5 | RISC_SECCFGR5_SEC163_Pos)
#define RIF_PERIPH_GPIOE               (RIF_PERIPH_REG5 | RISC_SECCFGR5_SEC164_Pos)
#define RIF_PERIPH_GPIOF               (RIF_PERIPH_REG5 | RISC_SECCFGR5_SEC165_Pos)
#define RIF_PERIPH_GPIOG               (RIF_PERIPH_REG5 | RISC_SECCFGR5_SEC166_Pos)
#define RIF_PERIPH_GPIOH               (RIF_PERIPH_REG5 | RISC_SECCFGR5_SEC167_Pos)
#define RIF_PERIPH_GPIOI               (RIF_PERIPH_REG5 | RISC_SECCFGR5_SEC168_Pos)
#if defined (GPIOJ)
#define RIF_PERIPH_GPIOJ               (RIF_PERIPH_REG5 | RISC_SECCFGR5_SEC169_Pos)
#endif /* GPIOJ */
#if defined (GPIOK)
#define RIF_PERIPH_GPIOK               (RIF_PERIPH_REG5 | RISC_SECCFGR5_SEC170_Pos)
#endif /* GPIOI */
#define RIF_PERIPH_GPIOZ               (RIF_PERIPH_REG5 | RISC_SECCFGR5_SEC171_Pos)
#define RIF_PERIPH_RES172              (RIF_PERIPH_REG5 | RISC_SECCFGR5_SEC172_Pos)
#define RIF_PERIPH_RES173              (RIF_PERIPH_REG5 | RISC_SECCFGR5_SEC173_Pos)
#define RIF_PERIPH_DDRCRTL             (RIF_PERIPH_REG5 | RISC_SECCFGR5_SEC174_Pos)
#define RIF_PERIPH_DDRPHYC             (RIF_PERIPH_REG5 | RISC_SECCFGR5_SEC175_Pos)
#define RIF_PERIPH_FMC                 (RIF_PERIPH_REG5 | RISC_SECCFGR5_SEC176_Pos)
#define RIF_PERIPH_BSEC                (RIF_PERIPH_REG5 | RISC_SECCFGR5_SEC177_Pos)
#define RIF_PERIPH_RES178              (RIF_PERIPH_REG5 | RISC_SECCFGR5_SEC178_Pos)
#define RIF_PERIPH_RES179              (RIF_PERIPH_REG5 | RISC_SECCFGR5_SEC179_Pos)
#define RIF_PERIPH_RES180              (RIF_PERIPH_REG5 | RISC_SECCFGR5_SEC180_Pos)
#define RIF_PERIPH_RES181              (RIF_PERIPH_REG5 | RISC_SECCFGR5_SEC181_Pos)
#define RIF_PERIPH_RES182              (RIF_PERIPH_REG5 | RISC_SECCFGR5_SEC182_Pos)
#define RIF_PERIPH_RES183              (RIF_PERIPH_REG5 | RISC_SECCFGR5_SEC183_Pos)
#define RIF_PERIPH_RES184              (RIF_PERIPH_REG5 | RISC_SECCFGR5_SEC184_Pos)
#define RIF_PERIPH_RES185              (RIF_PERIPH_REG5 | RISC_SECCFGR5_SEC185_Pos)
#define RIF_PERIPH_RES186              (RIF_PERIPH_REG5 | RISC_SECCFGR5_SEC186_Pos)
#define RIF_PERIPH_RES187              (RIF_PERIPH_REG5 | RISC_SECCFGR5_SEC187_Pos)
#define RIF_PERIPH_RES188              (RIF_PERIPH_REG5 | RISC_SECCFGR5_SEC188_Pos)
#define RIF_PERIPH_RES189              (RIF_PERIPH_REG5 | RISC_SECCFGR5_SEC189_Pos)
#define RIF_PERIPH_RES190              (RIF_PERIPH_REG5 | RISC_SECCFGR5_SEC190_Pos)
#define RIF_PERIPH_RES191              (RIF_PERIPH_REG5 | RISC_SECCFGR5_SEC191_Pos)

#if defined(OTFDEC2)
#define RIF_NB_PERIPH_MAX              (RIF_GET_ARRAY_INDEX(RIF_PERIPH_OTFDEC2) + 1)
#elif defined(OTFDEC1)
#define RIF_NB_PERIPH_MAX              (RIF_GET_ARRAY_INDEX(RIF_PERIPH_OTFDEC1) + 1)
#else
#define RIF_NB_PERIPH_MAX              (RIF_GET_ARRAY_INDEX(RIF_PERIPH_RES124) + 1)
#endif /* OTFDEC2/OTFDEC1 */
#define RIF_NB_PERIPH_LAST             (RIF_GET_ARRAY_INDEX(RIF_PERIPH_RES191) + 1U)

