zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_hal_rif.h
#define RIF_PERIPH_ALL                 (RIF_PERIPH_ALLIP_Msk)

#if defined(LPSRAM1_BASE)
#define RISAL1                         (RISC_BASE+0x900U)
#endif /* LPSRAM1 */
#if defined(LPSRAM2_BASE)
#define RISAL2                         (RISC_BASE+0x910U)
#endif /* LPSRAM2 */
#if defined(LPSRAM3_BASE)
#define RISAL3                         (RISC_BASE+0x920U)
#endif /* LPSRAM3 */

#define RIF_SYSRAMLOW                  ((uint32_t)RISAB1)
#define RIF_SYSRAMHIGH                 ((uint32_t)RISAB2)
#define RIF_SRAM1                      ((uint32_t)RISAB3)
#if defined(RISAB4)
#define RIF_SRAM2                      ((uint32_t)RISAB4)
#endif /* RISAB4 */
#define RIF_RETRAM                     ((uint32_t)RISAB5)
#if defined(RISAB6)
#define RIF_VDERAM                     ((uint32_t)RISAB6)
#endif /* RISAB6 */
#define RIF_BCKRAM                     ((uint32_t)RISAF1)
#define RIF_OCTOSPI12                  ((uint32_t)RISAF2)
#define RIF_DDR                        ((uint32_t)RISAF4)
#if defined(RISAF5)
#define RIF_PCIE                       ((uint32_t)RISAF5)
#endif /* RISAF5 */
#if defined(LPSRAM1_BASE)
#define RIF_LPSRAM1                    ((uint32_t)RISAL1)
#endif /* LPSRAM1_BASE */
#if defined(LPSRAM2_BASE)
#define RIF_LPSRAM2                    ((uint32_t)RISAL2)
#endif /* LPSRAM2_BASE */
#if defined(LPSRAM3_BASE)
#define RIF_LPSRAM3                    ((uint32_t)RISAL3)
#endif /* LPSRAM3_BASE */

/** @defgroup RIF_Master_Identification RIF Master Identification
  * @{
  */
/* Master Fixed values */
#define RIF_MCID_MAX                   (15U)
#define RIF_MCID_UNKNOWN               (0xFFFFFFFFU)

#define RIF_MCID_CPU1                  (0x01U)
#define RIF_MCID_CPU2                  (0x02U)
#if defined(RIF_CID_CPU3_CM0)
#define RIF_MCID_CPU3                  (0x03U)
#endif /* RIF_CID_CPU3_CM0 */
/* Master CID index */
#define RIF_MCID_TRACE                 (0U)
#define RIF_MCID_SDMMC1                (1U)
#define RIF_MCID_SDMMC2                (2U)
#define RIF_MCID_SDMMC3                (3U)
#if !defined(RIF_DERIVATIVE1_RESOURCES)
#define RIF_MCID_USB3DR                (4U)
#else
#define RIF_MCID_OTG_HS                (4U)
#endif /* RIF_DERIVATIVE1_RESOURCES */
#define RIF_MCID_USBH                  (5U)
#define RIF_MCID_ETH1                  (6U)
#define RIF_MCID_ETH2                  (7U)
#if defined(RISAF5)
#define RIF_MCID_PCIE                  (8U)
#endif /* RISAF5 */
#if defined(GPU)
#define RIF_MCID_GPU                   (9U)
#else
#define RIF_MCID_GPU                   RIF_MCID_UNKNOWN
#endif /* GPU */
#define RIF_MCID_DCMIPP                (10U)
#define RIF_MCID_LTDC_L1_L2            (11U)
#define RIF_MCID_LTDC_L3               (12U)
#if !defined(RIF_DERIVATIVE1_RESOURCES)
#define RIF_MCID_LTDC_ROT              (13U)
#endif /* RIF_DERIVATIVE1_RESOURCES */
#if defined(VDEC)
#define RIF_MCID_VDEC                  (14U)
#else
#define RIF_MCID_VDEC                  RIF_MCID_UNKNOWN
#endif /* VDEC */
#if defined(VENC)
#define RIF_MCID_VENC                  (15U)
#else
#define RIF_MCID_VENC                  RIF_MCID_UNKNOWN
#endif /* VENC */

/* DAPCID specific value (highest level of debug access) */
#define DAPCID_MASTER                  (0x07U)
/**
  * @}
  */

/**
  * @}
  */

/* RIF user-oriented definition  */
#define RIF_HAL_ERROR                  ((uint32_t)-1)

/* PERIPH user-oriented definition  */
#define RIF_PERIPH_LOCK_OFF            (0U)
#define RIF_PERIPH_LOCK_ON             (1U)

#if defined(RIF_LPSRAM1) && defined(RIF_LPSRAM2) && defined(RIF_LPSRAM3)
/* RISAL user-oriented definitions */
#define RIF_RISAL_MEM_SUBREGA          (0U)
#define RIF_RISAL_MEM_SUBREGB          (1U)
#define RIF_RISAL_MEM_GRANULARITY      (8U)

#endif /* RIF_LPSRAM1 && RIF_LPSRAM2 && RIF_LPSRAM3 */
/* RIMC user-oriented definition  */
#define RIF_RIMC_LOCK_OFF              (0U)
#define RIF_RIMC_LOCK_ON               (1U)

/* RISAB user-oriented definitions */
#define RIF_RISAB_LOCK_OFF             (0U)
#define RIF_RISAB_LOCK_ON              (1U)

/* RISAF user-oriented definitions */
#define RIF_RISAF_LOCK_OFF             (0U)
#define RIF_RISAF_LOCK_ON              (1U)
#define RIF_RISAF_MEM_SUBREGA          (0U)
#define RIF_RISAF_MEM_SUBREGB          (1U)

/** @defgroup IAC_Flag RIF IAC flag values
  * @{
  */

/* user-oriented definitions for HAL_IAC_GetFlag() flag parameter */
#define IAC_NO_ILA_EVENT               (0U)
#define IAC_ILA_EVENT_PENDING          (1U)

/* user-oriented definitions for HAL_IAC_GetErrorStatus() flag parameter */
#define IAC_COMP_NO_ERROR              (0U)
#define IAC_COMP_ERROR                 (1U)
#define IAC_SEC_NO_ERROR               (0U)
#define IAC_SEC_ERROR                  (1U)
#define IAC_PRIV_NO_ERROR              (0U)
#define IAC_PRIV_ERROR                 (1U)

/**
  * @}
  */

/**
  * @}
  */

/* Exported macros -----------------------------------------------------------*/

/** @defgroup RIF_Exported_Macros RIF Exported Macros
  * @{
  */

/**
  * @}
  */

/* Exported functions --------------------------------------------------------*/

/** @addtogroup RIF_Exported_Functions
  * @{
  */
#if defined(CORE_CM33) || defined(CORE_CA35)
/** @addtogroup RIF_Exported_Functions_Group1
  * @brief    RISC configuration functions
  * @{
  */
#if defined(CORE_CA35) || defined(CORTEX_IN_SECURE_STATE)
HAL_StatusTypeDef HAL_RISC_ConfigPeriphAttributes(RIF_Periph_Desc *PeriphAttributes);
void HAL_RIF_PeriphGLock();
#endif /* defined(CORE_CA35) || defined(CORTEX_IN_SECURE_STATE) */
HAL_StatusTypeDef HAL_RISC_GetConfigPeriphAttributes(uint32_t PeriphId, RIF_Periph_Desc *PeriphAttributes);
uint32_t HAL_RIF_GetPeriphGLock(void);

#if defined(RIF_LPSRAM1) && defined(RIF_LPSRAM2) && defined(RIF_LPSRAM3)
/**
  * @}
  */

/** @addtogroup RIF_Exported_Functions_Group2
  * @brief    RISAL configuration functions
  * @{
  */
#if defined(CORE_CA35) || defined(CORTEX_IN_SECURE_STATE)
HAL_StatusTypeDef HAL_RISAL_ConfigMemAttributes(RIF_MemRisal_Desc *MemAttributes);
#endif /* defined(CORE_CA35) || defined(CORTEX_IN_SECURE_STATE) */
HAL_StatusTypeDef HAL_RISAL_GetConfigMemAttributes(uint32_t Instance, uint32_t SubRegId, \
                                                   RIF_MemRisal_Desc *MemAttributes);

#endif /* RIF_LPSRAM1 && RIF_LPSRAM2 && RIF_LPSRAM3 */
/**
  * @}
  */

/** @addtogroup RIF_Exported_Functions_Group3
  * @brief    RIMC functions
  * @{
  */

