zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_hal_rif.h
#if defined(CORE_CA35) || defined(CORTEX_IN_SECURE_STATE)
HAL_StatusTypeDef HAL_RIMC_ConfigTrustedAttributes(RIF_RIMC_TrustedDesc *Attributes);
HAL_StatusTypeDef HAL_RIMC_ConfigMasterAttributes(RIF_RIMC_MasterDesc *Attributes);
void HAL_RIMC_GLock();
#endif /* defined(CORE_CA35) || defined(CORTEX_IN_SECURE_STATE) */
HAL_StatusTypeDef HAL_RIMC_GetConfigTrustedAttributes(RIF_RIMC_TrustedDesc *Attributes);
HAL_StatusTypeDef HAL_RIMC_GetConfigMasterAttributes(uint32_t MasterId, RIF_RIMC_MasterDesc *Attributes);
uint32_t HAL_RIMC_GetGLock(void);

/**
  * @}
  */

/** @addtogroup RIF_Exported_Functions_Group4
  * @brief    RISAB functions
  * @{
  */

#if defined(CORE_CA35) || defined(CORTEX_IN_SECURE_STATE)
HAL_StatusTypeDef HAL_RISAB_ConfigMemAttributes(uint32_t PageId, RIF_MemRisab_Desc *MemAttributes);
void HAL_RISAB_MemGLock(uint32_t Instance);
#endif /* defined(CORE_CA35) || defined(CORTEX_IN_SECURE_STATE) */
HAL_StatusTypeDef HAL_RISAB_GetConfigMemAttributes(uint32_t Instance, uint32_t PageId, \
                                                   uint32_t Cid, RIF_MemRisab_Desc *MemAttributes);
uint32_t HAL_RISAB_GetMemGLock(uint32_t Instance);

/**
  * @}
  */

/** @addtogroup RIF_Exported_Functions_Group5
  * @brief    RISAF functions
  * @{
  */

#if defined(CORE_CA35) || defined(CORTEX_IN_SECURE_STATE)
HAL_StatusTypeDef HAL_RISAF_ConfigMemRegionAttributes(uint32_t RegionId, RIF_MemRisafReg_Desc *MemAttributes);
HAL_StatusTypeDef HAL_RISAF_ConfigMemSubRegionAttributes(uint32_t RegionId, RIF_MemRisafSubReg_Desc *MemAttributes);
HAL_StatusTypeDef HAL_RISAF_ConfigMemEncryptAttributes(RIF_MemRisafEncKey_Desc *MemAttributes);
void HAL_RISAF_MemGLock(uint32_t Instance);
#endif /* defined(CORE_CA35) || defined(CORTEX_IN_SECURE_STATE) */
HAL_StatusTypeDef HAL_RISAF_GetConfigMemRegionAttributes(uint32_t Instance, uint32_t RegionId, \
                                                         RIF_MemRisafReg_Desc *MemAttributes);
HAL_StatusTypeDef HAL_RISAF_GetConfigMemSubRegionAttributes(uint32_t Instance, uint32_t RegionId, \
                                                            uint32_t SubRegionId, \
                                                            RIF_MemRisafSubReg_Desc *MemAttributes);
uint32_t HAL_RISAF_GetMemGLock(uint32_t Instance);

/**
  * @}
  */

/** @addtogroup RIF_Exported_Functions_Group6
  * @brief    IAC functions
  * @{
  */

HAL_StatusTypeDef HAL_IAC_DisableIT(uint32_t PeriphId);
HAL_StatusTypeDef HAL_IAC_EnableIT(uint32_t PeriphId);
HAL_StatusTypeDef HAL_IAC_GetFlag(uint32_t PeriphId, uint32_t *Flag);
HAL_StatusTypeDef HAL_IAC_ClearFlag(uint32_t PeriphId);

/**
  * @}
  */

/** @addtogroup RIF_Exported_Functions_Group7
  * @brief    IRQ related Functions
  * @{
  */

void HAL_RIF_IRQHandler(void);
void HAL_IAC_Callback(uint32_t PeriphId);
#endif /* defined(CORE_CM33) || defined(CORE_CA35) */

/**
  * @}
  */

/**
  * @}
  */

/* Private macro ------------------------------------------------------------*/
/** @defgroup RIF_Private_Macros RIF Private Macros
  * @{
  */
/**
  * @brief  RIF private macros usable to retrieve information to access register
  *         for a specific PeriphId
  */
#define RIF_GET_REG_INDEX(periphid)        (((periphid) & RIF_PERIPH_REG_Msk) >> RIF_PERIPH_REG_Pos)
#define RIF_GET_PERIPH_POS(periphid)       ((periphid) & (RIF_PERIPH_BITPOS_Msk))

/**
  * @brief  RIF private macro to get array index of a specific PeriphId
  *         in case of RIF_PERIPH_ALLIP_Msk usage in the two following functions:
  *         HAL_RISC_ConfigPeriphAttributes and HAL_RISC_GetConfigPeriphAttributes
  */
#define RIF_GET_ARRAY_INDEX(periphid)      (((RIF_GET_REG_INDEX(periphid))*32U) + (RIF_GET_PERIPH_POS(periphid)))


/**
  * @brief  RIF private macros to check function input parameters
  */
#define IS_RIF_ATTRIBUTE(__ATTRIBUTES__)   (((__ATTRIBUTES__) & ~(RIF_ATTRIBUTE_SEC | RIF_ATTRIBUTE_PRIV)) == 0x00u)

#define IS_RIF_PERIPHERAL(__PERIPHERAL__)  (((((__PERIPHERAL__) & ~\
                                               (RIF_PERIPH_REG_Msk | RIF_PERIPH_BITPOS_Msk)) == 0x00u) && \
                                             ((RIF_GET_ARRAY_INDEX(__PERIPHERAL__) < RIF_NB_PERIPH_LAST))) || \
                                            ((__PERIPHERAL__) == RIF_PERIPH_ALLIP_Msk))

#if defined(RIF_LPSRAM1) && defined(RIF_LPSRAM2) && defined(RIF_LPSRAM3)
#define IS_RISAL_INSTANCE(instance) \
  ( ( (uint32_t)(instance) == (uint32_t)(RIF_LPSRAM1) ) || \
    ( (uint32_t)(instance) == (uint32_t)(RIF_LPSRAM2) ) || \
    ( (uint32_t)(instance) == (uint32_t)(RIF_LPSRAM3) ) )

#define IS_RISAL_SUBREG(subreg) \
  ( ( (uint32_t)(subreg) == (uint32_t)(RIF_RISAL_MEM_SUBREGA) ) || \
    ( (uint32_t)(subreg) == (uint32_t)(RIF_RISAL_MEM_SUBREGB) ) )

#endif /* RIF_LPSRAM1 && RIF_LPSRAM2 && RIF_LPSRAM3 */
#if defined(RIF_DERIVATIVE1_RESOURCES)
#define IS_RIMC_MASTERID(cid) \
  ( ((uint32_t)(cid) <= RIF_MCID_MAX) && \
    ( ((uint32_t)(cid) == RIF_MCID_TRACE ) || \
      ((uint32_t)(cid) == RIF_MCID_SDMMC1 ) || \
      ((uint32_t)(cid) == RIF_MCID_SDMMC2 ) || \
      ((uint32_t)(cid) == RIF_MCID_SDMMC3 ) || \
      ((uint32_t)(cid) == RIF_MCID_OTG_HS ) || \
      ((uint32_t)(cid) == RIF_MCID_USBH ) || \
      ((uint32_t)(cid) == RIF_MCID_ETH1 ) || \
      ((uint32_t)(cid) == RIF_MCID_ETH2 ) || \
      ((uint32_t)(cid) == RIF_MCID_DCMIPP ) || \
      ((uint32_t)(cid) == RIF_MCID_LTDC_L1_L2 ) || \
      ((uint32_t)(cid) == RIF_MCID_LTDC_L3 ) ) )
#elif defined(RIF_DERIVATIVE2_RESOURCES)
#define IS_RIMC_MASTERID(cid) \
  ( ((uint32_t)(cid) <= RIF_MCID_MAX) && \
    ( ((uint32_t)(cid) == RIF_MCID_TRACE ) || \
      ((uint32_t)(cid) == RIF_MCID_SDMMC1 ) || \
      ((uint32_t)(cid) == RIF_MCID_SDMMC2 ) || \
      ((uint32_t)(cid) == RIF_MCID_SDMMC3 ) || \
      ((uint32_t)(cid) == RIF_MCID_USB3DR ) || \
      ((uint32_t)(cid) == RIF_MCID_USBH ) || \
      ((uint32_t)(cid) == RIF_MCID_ETH1 ) || \
      ((uint32_t)(cid) == RIF_MCID_ETH2 ) || \
      ((uint32_t)(cid) == RIF_MCID_PCIE ) || \
      ((uint32_t)(cid) == RIF_MCID_GPU ) || \
      ((uint32_t)(cid) == RIF_MCID_DCMIPP ) || \
      ((uint32_t)(cid) == RIF_MCID_LTDC_L1_L2 ) || \
      ((uint32_t)(cid) == RIF_MCID_LTDC_L3 ) || \
      ((uint32_t)(cid) == RIF_MCID_LTDC_ROT ) || \
      ((uint32_t)(cid) == RIF_MCID_VDEC ) ) )
#else
#define IS_RIMC_MASTERID(cid) \
  ( ((uint32_t)(cid) <= RIF_MCID_MAX) && \
    ( ((uint32_t)(cid) == RIF_MCID_TRACE ) || \
      ((uint32_t)(cid) == RIF_MCID_SDMMC1 ) || \
      ((uint32_t)(cid) == RIF_MCID_SDMMC2 ) || \
      ((uint32_t)(cid) == RIF_MCID_SDMMC3 ) || \
      ((uint32_t)(cid) == RIF_MCID_USB3DR ) || \
      ((uint32_t)(cid) == RIF_MCID_USBH ) || \
      ((uint32_t)(cid) == RIF_MCID_ETH1 ) || \
      ((uint32_t)(cid) == RIF_MCID_ETH2 ) || \
      ((uint32_t)(cid) == RIF_MCID_PCIE ) || \
      ((uint32_t)(cid) == RIF_MCID_GPU ) || \
      ((uint32_t)(cid) == RIF_MCID_DCMIPP ) || \
      ((uint32_t)(cid) == RIF_MCID_LTDC_L1_L2 ) || \
      ((uint32_t)(cid) == RIF_MCID_LTDC_L3 ) || \
      ((uint32_t)(cid) == RIF_MCID_LTDC_ROT ) || \
      ((uint32_t)(cid) == RIF_MCID_VDEC ) || \
      ((uint32_t)(cid) == RIF_MCID_VENC ) ) )
#endif /* RIF_DERIVATIVE1_RESOURCES */

#define IS_RIMC_TDCID(cid) \
  ( ( (uint32_t)(cid) == RIMC_CR_TDCID0 ) || \
    ( (uint32_t)(cid) == RIMC_CR_TDCID1 ) || \
    ( (uint32_t)(cid) == RIMC_CR_TDCID2 ) || \
    ( (uint32_t)(cid) == RIMC_CR_TDCID3 ) || \
    ( (uint32_t)(cid) == RIMC_CR_TDCID4 ) || \
    ( (uint32_t)(cid) == RIMC_CR_TDCID5 ) || \
    ( (uint32_t)(cid) == RIMC_CR_TDCID6 ) || \
    ( (uint32_t)(cid) == RIMC_CR_TDCID7 ) )

#define IS_RIMC_DAPCID(cid) \
  ( ( (uint32_t)(cid) == RIMC_CR_DAPCID0 ) || \
    ( (uint32_t)(cid) == RIMC_CR_DAPCID1 ) || \
    ( (uint32_t)(cid) == RIMC_CR_DAPCID2 ) || \
    ( (uint32_t)(cid) == RIMC_CR_DAPCID3 ) || \
    ( (uint32_t)(cid) == RIMC_CR_DAPCID4 ) || \
    ( (uint32_t)(cid) == RIMC_CR_DAPCID5 ) || \
    ( (uint32_t)(cid) == RIMC_CR_DAPCID6 ) || \
    ( (uint32_t)(cid) == RIMC_CR_DAPCID7 ) )

