zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_hal_rif.h
#define IS_RIMC_MASTERCID(cid) \
  ( ( (uint32_t)(cid) == RIMC_ATTR_MCID0 ) || \
    ( (uint32_t)(cid) == RIMC_ATTR_MCID1 ) || \
    ( (uint32_t)(cid) == RIMC_ATTR_MCID2 ) || \
    ( (uint32_t)(cid) == RIMC_ATTR_MCID3 ) || \
    ( (uint32_t)(cid) == RIMC_ATTR_MCID4 ) || \
    ( (uint32_t)(cid) == RIMC_ATTR_MCID5 ) || \
    ( (uint32_t)(cid) == RIMC_ATTR_MCID6 ) || \
    ( (uint32_t)(cid) == RIMC_ATTR_MCID7 ) )

#if defined(RIF_DERIVATIVE1_RESOURCES)
#define IS_RISAB_INSTANCE(instance) \
  ( ( (uint32_t)(instance) == (uint32_t)(RIF_SYSRAMLOW) ) || \
    ( (uint32_t)(instance) == (uint32_t)(RIF_SYSRAMHIGH) ) || \
    ( (uint32_t)(instance) == (uint32_t)(RIF_SRAM1) ) || \
    ( (uint32_t)(instance) == (uint32_t)(RIF_RETRAM) ) )
#else
#define IS_RISAB_INSTANCE(instance) \
  ( ( (uint32_t)(instance) == (uint32_t)(RIF_SYSRAMLOW) ) || \
    ( (uint32_t)(instance) == (uint32_t)(RIF_SYSRAMHIGH) ) || \
    ( (uint32_t)(instance) == (uint32_t)(RIF_SRAM1) ) || \
    ( (uint32_t)(instance) == (uint32_t)(RIF_SRAM2) ) || \
    ( (uint32_t)(instance) == (uint32_t)(RIF_RETRAM) ) || \
    ( (uint32_t)(instance) == (uint32_t)(RIF_VDERAM) ) )
#endif /* RIF_DERIVATIVE1_RESOURCES */

#if defined(RIF_CID_CPU3_CM0)
#define IS_RISAB_CID(cid) \
  ( ( (uint32_t)(cid) == RIF_MCID_CPU1 ) || \
    ( (uint32_t)(cid) == RIF_MCID_CPU2 ) || \
    ( (uint32_t)(cid) == RIF_MCID_CPU3 ) )
#else
#define IS_RISAB_CID(cid) \
  ( ( (uint32_t)(cid) == RIF_MCID_CPU1 ) || \
    ( (uint32_t)(cid) == RIF_MCID_CPU2 ) )
#endif /* RIF_CID_CPU3_CM0 */


#define IS_RISAB_PAGEID(pageid) \
  ( ( (uint32_t)(pageid) >= 0U ) && \
    ( (uint32_t)(pageid) < RIF_PAGE_MAX ) )

#define IS_RISAB_DCCID(cid) \
  ( ( (uint32_t)(cid) == RISAB_PGCIDCFGR_DCCIDC0 ) || \
    ( (uint32_t)(cid) == RISAB_PGCIDCFGR_DCCIDC1 ) || \
    ( (uint32_t)(cid) == RISAB_PGCIDCFGR_DCCIDC2 ) || \
    ( (uint32_t)(cid) == RISAB_PGCIDCFGR_DCCIDC3 ) || \
    ( (uint32_t)(cid) == RISAB_PGCIDCFGR_DCCIDC4 ) || \
    ( (uint32_t)(cid) == RISAB_PGCIDCFGR_DCCIDC5 ) || \
    ( (uint32_t)(cid) == RISAB_PGCIDCFGR_DCCIDC6 ) || \
    ( (uint32_t)(cid) == RISAB_PGCIDCFGR_DCCIDC7 ) )

#if defined(RIF_PCIE)
#define IS_RISAF_INSTANCE(instance) \
  ( ( (uint32_t)(instance) == (uint32_t)(RIF_BCKRAM) ) || \
    ( (uint32_t)(instance) == (uint32_t)(RIF_OCTOSPI12) ) || \
    ( (uint32_t)(instance) == (uint32_t)(RIF_DDR) ) || \
    ( (uint32_t)(instance) == (uint32_t)(RIF_PCIE) ) )
#else
#define IS_RISAF_INSTANCE(instance) \
  ( ( (uint32_t)(instance) == (uint32_t)(RIF_BCKRAM) ) || \
    ( (uint32_t)(instance) == (uint32_t)(RIF_OCTOSPI12) ) || \
    ( (uint32_t)(instance) == (uint32_t)(RIF_DDR) ) )


#endif /* RIF_PCIE */
#define IS_RISAF_REGIONID(regionid) \
  ( ( (uint32_t)(regionid) >= 0U ) && \
    ( (uint32_t)(regionid) < RIF_REGION_MAX ) )

#define IS_RISAF_SUBREGID(subreg) \
  ( ( (uint32_t)(subreg) == (uint32_t)(RIF_RISAF_MEM_SUBREGA) ) || \
    ( (uint32_t)(subreg) == (uint32_t)(RIF_RISAF_MEM_SUBREGB) ) )

#define IS_RISAF_CIDPRIV(cid) \
  ( ( (uint32_t)(cid & RISAF_REGCFGR_PRIV_Msk) == cid ) )

#define IS_RISAF_CIDREAD(cid) \
  ( ( (uint32_t)(cid & RISAF_REGCIDCFGR_RDEN_Msk) == cid ) )

#define IS_RISAF_CIDWRITE(cid) \
  ( ( (uint32_t)(cid & RISAF_REGCIDCFGR_WREN_Msk) == cid ) )

#define IS_RISAF_DCCID(cid) \
  ( ( (uint32_t)(cid) == RISAF_REGZNESTR_DCCID0 ) || \
    ( (uint32_t)(cid) == RISAF_REGZNESTR_DCCID1 ) || \
    ( (uint32_t)(cid) == RISAF_REGZNESTR_DCCID2 ) || \
    ( (uint32_t)(cid) == RISAF_REGZNESTR_DCCID3 ) || \
    ( (uint32_t)(cid) == RISAF_REGZNESTR_DCCID4 ) || \
    ( (uint32_t)(cid) == RISAF_REGZNESTR_DCCID5 ) || \
    ( (uint32_t)(cid) == RISAF_REGZNESTR_DCCID6 ) || \
    ( (uint32_t)(cid) == RISAF_REGZNESTR_DCCID7 ) )

#define IS_RISAF_SRCID(cid) \
  ( ( (uint32_t)(cid) == RISAF_REGZCFGR_SRCID0 ) || \
    ( (uint32_t)(cid) == RISAF_REGZCFGR_SRCID1 ) || \
    ( (uint32_t)(cid) == RISAF_REGZCFGR_SRCID2 ) || \
    ( (uint32_t)(cid) == RISAF_REGZCFGR_SRCID3 ) || \
    ( (uint32_t)(cid) == RISAF_REGZCFGR_SRCID4 ) || \
    ( (uint32_t)(cid) == RISAF_REGZCFGR_SRCID5 ) || \
    ( (uint32_t)(cid) == RISAF_REGZCFGR_SRCID6 ) || \
    ( (uint32_t)(cid) == RISAF_REGZCFGR_SRCID7 ) )

#if defined(CORE_CA35) || defined(CORTEX_IN_SECURE_STATE)
#define SEC_SET_BIT(REG, BIT)                   SET_BIT(REG, BIT)
#define SEC_CLEAR_BIT(REG, BIT)                 CLEAR_BIT(REG, BIT)
#define SEC_READ_BIT(REG, BIT)                  READ_BIT(REG, BIT)
#define SEC_CLEAR_REG(REG)                      CLEAR_REG(REG)
#define SEC_WRITE_REG(REG, VAL)                 WRITE_REG(REG, VAL)
#define SEC_READ_REG(REG)                       READ_REG(REG)
#define SEC_MODIFY_REG(REG, CLEARMASK, SETMASK) MODIFY_REG(REG, CLEARMASK, SETMASK)
#else
#define SEC_SET_BIT(REG, BIT)
#define SEC_CLEAR_BIT(REG, BIT)
#define SEC_READ_BIT(REG, BIT)                  READ_BIT(REG, BIT)
#define SEC_CLEAR_REG(REG)
#define SEC_WRITE_REG(REG, VAL)
#define SEC_READ_REG(REG)                       READ_REG(REG)
#define SEC_MODIFY_REG(REG, CLEARMASK, SETMASK)
#endif /* defined(CORE_CA35) || defined(CORTEX_IN_SECURE_STATE) */

/**
  * @brief  RIF private macros to configure RISC
  */
#define HAL_RIF_IS_RISC_CFEN(periphid)      (SEC_READ_BIT\
                                             ((RISC->PER[RIF_GET_ARRAY_INDEX(periphid) & 0x7FU].CIDCFGR)\
                                              , RISC_PERCIDCFGR_CFEN))
#define HAL_RIF_IS_RISC_SEMEN(periphid)     (SEC_READ_BIT\
                                             ((RISC->PER[RIF_GET_ARRAY_INDEX(periphid) & 0x7FU].CIDCFGR)\
                                              , RISC_PERCIDCFGR_SEMEN))
#define HAL_RIF_IS_RISC_SEMMUTEX(periphid)  (READ_BIT\
                                             (RISC->PER[RIF_GET_ARRAY_INDEX(periphid) & 0x7FU].SEMCR\
                                              , RISC_PERSEMCR_SEMMUTEX))
#define HAL_RIF_IS_RISC_RLOCK(periphid)     (SEC_READ_BIT\
                                             ((RISC->RCFGLOCKR[RIF_GET_REG_INDEX(periphid)\
                                                               % (sizeof(RISC->RCFGLOCKR)/sizeof(RISC->RCFGLOCKR[0]))])\
                                              , (1UL<<RIF_GET_PERIPH_POS(periphid))))
#define HAL_RIF_IS_RISC_SEC(periphid)       (SEC_READ_BIT\
                                             ((RISC->SECCFGR[RIF_GET_REG_INDEX(periphid)\
                                                             % (sizeof(RISC->SECCFGR)/sizeof(RISC->SECCFGR[0]))])\
                                              , (1UL<<RIF_GET_PERIPH_POS(periphid))))
#define HAL_RIF_IS_RISC_PRIV(periphid)      (SEC_READ_BIT\
                                             ((RISC->PRIVCFGR[RIF_GET_REG_INDEX(periphid)\
                                                              % (sizeof(RISC->PRIVCFGR)/sizeof(RISC->PRIVCFGR[0]))])\
                                              , (1UL<<RIF_GET_PERIPH_POS(periphid))))
#define HAL_RIF_IS_RISC_GLOCK()             (SEC_READ_BIT((RISC->CR), RISC_CR_GLOCK))

#define HAL_RIF_SET_RISC_CFEN(periphid)            (SEC_SET_BIT\
                                                    ((RISC->PER[RIF_GET_ARRAY_INDEX(periphid)].CIDCFGR)\
                                                     , RISC_PERCIDCFGR_CFEN))
#define HAL_RIF_SET_RISC_SEMEN(periphid)           (SEC_SET_BIT\
                                                    ((RISC->PER[RIF_GET_ARRAY_INDEX(periphid)].CIDCFGR)\
                                                     , RISC_PERCIDCFGR_SEMEN))
#define HAL_RIF_SET_RISC_RLOCK(periphid)           (SEC_SET_BIT\
                                                    ((RISC->RCFGLOCKR[RIF_GET_REG_INDEX(periphid)])\
                                                     , 1<<RIF_GET_PERIPH_POS(periphid)))
#define HAL_RIF_SET_RISC_SEC(periphid)             (SEC_SET_BIT\
                                                    ((RISC->SECCFGR[RIF_GET_REG_INDEX(periphid)])\
                                                     , 1<<RIF_GET_PERIPH_POS(periphid)))
#define HAL_RIF_SET_RISC_PRIV(periphid)            (SEC_SET_BIT\
                                                    ((RISC->PRIVCFGR[RIF_GET_REG_INDEX(periphid)])\
                                                     , 1<<RIF_GET_PERIPH_POS(periphid)))
#define HAL_RIF_SET_RISC_GLOCK()                   (SEC_SET_BIT((RISC->CR), RISC_CR_GLOCK))

