zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_hal_rif.h
#define HAL_RIF_CLEAR_RISC_CFEN(periphid)          (SEC_CLEAR_BIT\
                                                    ((RISC->PER[RIF_GET_ARRAY_INDEX(periphid)].CIDCFGR)\
                                                     , RISC_PERCIDCFGR_CFEN))
#define HAL_RIF_CLEAR_RISC_SEMEN(periphid)         (SEC_CLEAR_BIT\
                                                    ((RISC->PER[RIF_GET_ARRAY_INDEX(periphid)].CIDCFGR)\
                                                     , RISC_PERCIDCFGR_SEMEN))
#define HAL_RIF_CLEAR_RISC_RLOCK(periphid)         (SEC_CLEAR_BIT\
                                                    ((RISC->RCFGLOCKR[RIF_GET_REG_INDEX(periphid)])\
                                                     , 1<<RIF_GET_PERIPH_POS(periphid)))
#define HAL_RIF_CLEAR_RISC_SEC(periphid)           (SEC_CLEAR_BIT\
                                                    ((RISC->SECCFGR[RIF_GET_REG_INDEX(periphid)])\
                                                     , 1<<RIF_GET_PERIPH_POS(periphid)))
#define HAL_RIF_CLEAR_RISC_PRIV(periphid)          (SEC_CLEAR_BIT\
                                                    ((RISC->PRIVCFGR[RIF_GET_REG_INDEX(periphid)])\
                                                     , 1<<RIF_GET_PERIPH_POS(periphid)))

/* SCID */
#define HAL_RIF_READ_RISC_SCID(periphid)           (SEC_READ_BIT\
                                                    ((RISC->PER[RIF_GET_ARRAY_INDEX(periphid)& 0x7FU].CIDCFGR)\
                                                     , RISC_PERCIDCFGR_SCID))
#define HAL_RIF_SET_RISC_SCID(periphid,scid)       (SEC_MODIFY_REG\
                                                    ((RISC->PER[RIF_GET_ARRAY_INDEX(periphid)].CIDCFGR)\
                                                     , RISC_PERCIDCFGR_SCID_Msk, scid & RISC_PERCIDCFGR_SCID_Msk))
#define HAL_RIF_IS_RISC_SCIDCX(periphid,scid)      (HAL_RIF_READ_RISC_SCID(periphid) == scid ? 1 : 0)
#define HAL_RIF_CLEAR_RISC_SCID(periphid)          (SEC_CLEAR_BIT\
                                                    ((RISC->PER[RIF_GET_ARRAY_INDEX(periphid)].CIDCFGR)\
                                                     , RISC_PERCIDCFGR_SCID))
/* SEMWL */
#define HAL_RIF_READ_RISC_SEMWL(periphid)          (SEC_READ_BIT\
                                                    ((RISC->PER[RIF_GET_ARRAY_INDEX(periphid) & 0x7FU].CIDCFGR)\
                                                     , RISC_PERCIDCFGR_SEMWL))
#define HAL_RIF_IS_RISC_SEMWLCX(periphid,cid)      (SEC_READ_BIT\
                                                    ((RISC->PER[RIF_GET_ARRAY_INDEX(periphid)].CIDCFGR), cid))
#define HAL_RIF_SET_RISC_SEMWLCX(periphid,cid)     (SEC_MODIFY_REG\
                                                    ((RISC->PER[RIF_GET_ARRAY_INDEX(periphid )].CIDCFGR)\
                                                     , RISC_PERCIDCFGR_SEMWL_Msk, cid & RISC_PERCIDCFGR_SEMWL_Msk))
#define HAL_RIF_RESET_RISC_SEMWLCX(periphid,cid)   (SEC_CLEAR_BIT\
                                                    ((RISC->PER[RIF_GET_ARRAY_INDEX(periphid)].CIDCFGR), cid))
/* SEMCID */
#define HAL_RIF_READ_RISC_SEMCID(periphid)         (SEC_READ_BIT\
                                                    ((RISC->PER[RIF_GET_ARRAY_INDEX(periphid)].SEMCR)\
                                                     , RISC_PERSEMCR_SEMCID))
#define HAL_RIF_IS_RISC_SEMCIDCX(periphid,semcid)  (HAL_RIF_READ_RISC_SEMCID(periphid) == semcid  ? 1 : 0)
/* SEMMUTEX */
#define HAL_RIF_TAKE_RISC_SEM(periphid)            (SET_BIT(RISC->PER\
                                                            [RIF_GET_ARRAY_INDEX(periphid)].SEMCR\
                                                            , RISC_PERSEMCR_SEMMUTEX))
#define HAL_RIF_RELEASE_RISC_SEM(periphid)         (CLEAR_BIT(RISC->PER\
                                                              [RIF_GET_ARRAY_INDEX(periphid)].SEMCR\
                                                              , RISC_PERSEMCR_SEMMUTEX))

#if defined(RIF_LPSRAM1) && defined(RIF_LPSRAM2) && defined(RIF_LPSRAM3)
/**
  * @brief  RIF private macros to configure RISAL
  */
#define HAL_RIF_IS_RISAL1_SUBREGA_SREN()                  (SEC_READ_BIT((RISC->REG1ACFGR), RISC_REGCFGR_SREN))
#define HAL_RIF_IS_RISAL1_SUBREGA_RLOCK()                 (SEC_READ_BIT((RISC->REG1ACFGR), RISC_REGCFGR_RLOCK))
#define HAL_RIF_IS_RISAL1_SUBREGA_SEC()                   (SEC_READ_BIT((RISC->REG1ACFGR), RISC_REGCFGR_SEC))
#define HAL_RIF_IS_RISAL1_SUBREGA_PRIV()                  (SEC_READ_BIT((RISC->REG1ACFGR), RISC_REGCFGR_PRIV))
#define HAL_RIF_IS_RISAL1_SUBREGB_SREN()                  (SEC_READ_BIT((RISC->REG1BCFGR), RISC_REGCFGR_SREN))
#define HAL_RIF_IS_RISAL1_SUBREGB_RLOCK()                 (SEC_READ_BIT((RISC->REG1BCFGR), RISC_REGCFGR_RLOCK))
#define HAL_RIF_IS_RISAL1_SUBREGB_SEC()                   (SEC_READ_BIT((RISC->REG1BCFGR), RISC_REGCFGR_SEC))
#define HAL_RIF_IS_RISAL1_SUBREGB_PRIV()                  (SEC_READ_BIT((RISC->REG1BCFGR), RISC_REGCFGR_PRIV))

#define HAL_RIF_IS_RISAL2_SUBREGA_SREN()                  (SEC_READ_BIT((RISC->REG2ACFGR), RISC_REGCFGR_SREN))
#define HAL_RIF_IS_RISAL2_SUBREGA_RLOCK()                 (SEC_READ_BIT((RISC->REG2ACFGR), RISC_REGCFGR_RLOCK))
#define HAL_RIF_IS_RISAL2_SUBREGA_SEC()                   (SEC_READ_BIT((RISC->REG2ACFGR), RISC_REGCFGR_SEC))
#define HAL_RIF_IS_RISAL2_SUBREGA_PRIV()                  (SEC_READ_BIT((RISC->REG2ACFGR), RISC_REGCFGR_PRIV))
#define HAL_RIF_IS_RISAL2_SUBREGB_SREN()                  (SEC_READ_BIT((RISC->REG2BCFGR), RISC_REGCFGR_SREN))
#define HAL_RIF_IS_RISAL2_SUBREGB_RLOCK()                 (SEC_READ_BIT((RISC->REG2BCFGR), RISC_REGCFGR_RLOCK))
#define HAL_RIF_IS_RISAL2_SUBREGB_SEC()                   (SEC_READ_BIT((RISC->REG2BCFGR), RISC_REGCFGR_SEC))
#define HAL_RIF_IS_RISAL2_SUBREGB_PRIV()                  (SEC_READ_BIT((RISC->REG2BCFGR), RISC_REGCFGR_PRIV))

#define HAL_RIF_IS_RISAL3_SUBREGA_SREN()                  (SEC_READ_BIT((RISC->REG3ACFGR), RISC_REGCFGR_SREN))
#define HAL_RIF_IS_RISAL3_SUBREGA_RLOCK()                 (SEC_READ_BIT((RISC->REG3ACFGR), RISC_REGCFGR_RLOCK))
#define HAL_RIF_IS_RISAL3_SUBREGA_SEC()                   (SEC_READ_BIT((RISC->REG3ACFGR), RISC_REGCFGR_SEC))
#define HAL_RIF_IS_RISAL3_SUBREGA_PRIV()                  (SEC_READ_BIT((RISC->REG3ACFGR), RISC_REGCFGR_PRIV))
#define HAL_RIF_IS_RISAL3_SUBREGB_SREN()                  (SEC_READ_BIT((RISC->REG3BCFGR), RISC_REGCFGR_SREN))
#define HAL_RIF_IS_RISAL3_SUBREGB_RLOCK()                 (SEC_READ_BIT((RISC->REG3BCFGR), RISC_REGCFGR_RLOCK))
#define HAL_RIF_IS_RISAL3_SUBREGB_SEC()                   (SEC_READ_BIT((RISC->REG3BCFGR), RISC_REGCFGR_SEC))
#define HAL_RIF_IS_RISAL3_SUBREGB_PRIV()                  (SEC_READ_BIT((RISC->REG3BCFGR), RISC_REGCFGR_PRIV))

#define HAL_RIF_SET_RISAL1_SUBREGA_SREN()                 (SEC_SET_BIT((RISC->REG1ACFGR), RISC_REGCFGR_SREN))
#define HAL_RIF_SET_RISAL1_SUBREGA_RLOCK()                (SEC_SET_BIT((RISC->REG1ACFGR), RISC_REGCFGR_RLOCK))
#define HAL_RIF_SET_RISAL1_SUBREGA_SEC()                  (SEC_SET_BIT((RISC->REG1ACFGR), RISC_REGCFGR_SEC))
#define HAL_RIF_SET_RISAL1_SUBREGA_PRIV()                 (SEC_SET_BIT((RISC->REG1ACFGR), RISC_REGCFGR_PRIV))
#define HAL_RIF_SET_RISAL1_SUBREGB_SREN()                 (SEC_SET_BIT((RISC->REG1BCFGR), RISC_REGCFGR_SREN))
#define HAL_RIF_SET_RISAL1_SUBREGB_RLOCK()                (SEC_SET_BIT((RISC->REG1BCFGR), RISC_REGCFGR_RLOCK))
#define HAL_RIF_SET_RISAL1_SUBREGB_SEC()                  (SEC_SET_BIT((RISC->REG1BCFGR), RISC_REGCFGR_SEC))
#define HAL_RIF_SET_RISAL1_SUBREGB_PRIV()                 (SEC_SET_BIT((RISC->REG1BCFGR), RISC_REGCFGR_PRIV))

