zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_hal_rif.h
#define HAL_RIF_SET_RISAL2_SUBREGA_SREN()                 (SEC_SET_BIT((RISC->REG2ACFGR), RISC_REGCFGR_SREN))
#define HAL_RIF_SET_RISAL2_SUBREGA_RLOCK()                (SEC_SET_BIT((RISC->REG2ACFGR), RISC_REGCFGR_RLOCK))
#define HAL_RIF_SET_RISAL2_SUBREGA_SEC()                  (SEC_SET_BIT((RISC->REG2ACFGR), RISC_REGCFGR_SEC))
#define HAL_RIF_SET_RISAL2_SUBREGA_PRIV()                 (SEC_SET_BIT((RISC->REG2ACFGR), RISC_REGCFGR_PRIV))
#define HAL_RIF_SET_RISAL2_SUBREGB_SREN()                 (SEC_SET_BIT((RISC->REG2BCFGR), RISC_REGCFGR_SREN))
#define HAL_RIF_SET_RISAL2_SUBREGB_RLOCK()                (SEC_SET_BIT((RISC->REG2BCFGR), RISC_REGCFGR_RLOCK))
#define HAL_RIF_SET_RISAL2_SUBREGB_SEC()                  (SEC_SET_BIT((RISC->REG2BCFGR), RISC_REGCFGR_SEC))
#define HAL_RIF_SET_RISAL2_SUBREGB_PRIV()                 (SEC_SET_BIT((RISC->REG2BCFGR), RISC_REGCFGR_PRIV))

#define HAL_RIF_SET_RISAL3_SUBREGA_SREN()                 (SEC_SET_BIT((RISC->REG3ACFGR), RISC_REGCFGR_SREN))
#define HAL_RIF_SET_RISAL3_SUBREGA_RLOCK()                (SEC_SET_BIT((RISC->REG3ACFGR), RISC_REGCFGR_RLOCK))
#define HAL_RIF_SET_RISAL3_SUBREGA_SEC()                  (SEC_SET_BIT((RISC->REG3ACFGR), RISC_REGCFGR_SEC))
#define HAL_RIF_SET_RISAL3_SUBREGA_PRIV()                 (SEC_SET_BIT((RISC->REG3ACFGR), RISC_REGCFGR_PRIV))
#define HAL_RIF_SET_RISAL3_SUBREGB_SREN()                 (SEC_SET_BIT((RISC->REG3BCFGR), RISC_REGCFGR_SREN))
#define HAL_RIF_SET_RISAL3_SUBREGB_RLOCK()                (SEC_SET_BIT((RISC->REG3BCFGR), RISC_REGCFGR_RLOCK))
#define HAL_RIF_SET_RISAL3_SUBREGB_SEC()                  (SEC_SET_BIT((RISC->REG3BCFGR), RISC_REGCFGR_SEC))
#define HAL_RIF_SET_RISAL3_SUBREGB_PRIV()                 (SEC_SET_BIT((RISC->REG3BCFGR), RISC_REGCFGR_PRIV))
#define HAL_RIF_SET_RISAL3_SUBREGA_SUBSTART(val)          (SEC_MODIFY_REG((RISC->REG3AADDR),\
                                                                          RISC_REG3ADDR_SUBSTART_Msk,\
                                                                          val << RISC_REG3ADDR_SUBSTART_Pos))
#define HAL_RIF_SET_RISAL3_SUBREGA_SUBLENGTH(val)         (SEC_MODIFY_REG((RISC->REG3AADDR),\
                                                                          RISC_REG3ADDR_SUBLENGTH_Msk,\
                                                                          val << RISC_REG3ADDR_SUBLENGTH_Pos))
#define HAL_RIF_SET_RISAL3_SUBREGB_SUBSTART(val)          (SEC_MODIFY_REG((RISC->REG3BADDR),\
                                                                          RISC_REG3ADDR_SUBSTART_Msk,\
                                                                          val << RISC_REG3ADDR_SUBSTART_Pos))
#define HAL_RIF_SET_RISAL3_SUBREGB_SUBLENGTH(val)         (SEC_MODIFY_REG((RISC->REG3BADDR),\
                                                                          RISC_REG3ADDR_SUBLENGTH_Msk,\
                                                                          val << RISC_REG3ADDR_SUBLENGTH_Pos))

#define HAL_RIF_READ_RISAL3_SUBREGA_SUBSTART()            (SEC_READ_BIT((RISC->REG3AADDR),\
                                                                        RISC_REG3ADDR_SUBSTART_Msk)\
                                                           >> RISC_REG3ADDR_SUBSTART_Pos)
#define HAL_RIF_READ_RISAL3_SUBREGA_SUBLENGTH()           (SEC_READ_BIT((RISC->REG3AADDR),\
                                                                        RISC_REG3ADDR_SUBLENGTH_Msk)\
                                                           >> RISC_REG3ADDR_SUBLENGTH_Pos)
#define HAL_RIF_READ_RISAL3_SUBREGB_SUBSTART()            (SEC_READ_BIT((RISC->REG3BADDR),\
                                                                        RISC_REG3ADDR_SUBSTART_Msk)\
                                                           >> RISC_REG3ADDR_SUBSTART_Pos)
#define HAL_RIF_READ_RISAL3_SUBREGB_SUBLENGTH()           (SEC_READ_BIT((RISC->REG3BADDR),\
                                                                        RISC_REG3ADDR_SUBLENGTH_Msk)\
                                                           >> RISC_REG3ADDR_SUBLENGTH_Pos)

#define HAL_RIF_CLEAR_RISAL1_SUBREGA_SREN()               (SEC_CLEAR_BIT((RISC->REG1ACFGR), RISC_REGCFGR_SREN))
#define HAL_RIF_CLEAR_RISAL1_SUBREGA_RLOCK()              (SEC_CLEAR_BIT((RISC->REG1ACFGR), RISC_REGCFGR_RLOCK))
#define HAL_RIF_CLEAR_RISAL1_SUBREGA_SEC()                (SEC_CLEAR_BIT((RISC->REG1ACFGR), RISC_REGCFGR_SEC))
#define HAL_RIF_CLEAR_RISAL1_SUBREGA_PRIV()               (SEC_CLEAR_BIT((RISC->REG1ACFGR), RISC_REGCFGR_PRIV))
#define HAL_RIF_CLEAR_RISAL1_SUBREGB_SREN()               (SEC_CLEAR_BIT((RISC->REG1BCFGR), RISC_REGCFGR_SREN))
#define HAL_RIF_CLEAR_RISAL1_SUBREGB_RLOCK()              (SEC_CLEAR_BIT((RISC->REG1BCFGR), RISC_REGCFGR_RLOCK))
#define HAL_RIF_CLEAR_RISAL1_SUBREGB_SEC()                (SEC_CLEAR_BIT((RISC->REG1BCFGR), RISC_REGCFGR_SEC))
#define HAL_RIF_CLEAR_RISAL1_SUBREGB_PRIV()               (SEC_CLEAR_BIT((RISC->REG1BCFGR), RISC_REGCFGR_PRIV))

#define HAL_RIF_CLEAR_RISAL2_SUBREGA_SREN()               (SEC_CLEAR_BIT((RISC->REG2ACFGR), RISC_REGCFGR_SREN))
#define HAL_RIF_CLEAR_RISAL2_SUBREGA_RLOCK()              (SEC_CLEAR_BIT((RISC->REG2ACFGR), RISC_REGCFGR_RLOCK))
#define HAL_RIF_CLEAR_RISAL2_SUBREGA_SEC()                (SEC_CLEAR_BIT((RISC->REG2ACFGR), RISC_REGCFGR_SEC))
#define HAL_RIF_CLEAR_RISAL2_SUBREGA_PRIV()               (SEC_CLEAR_BIT((RISC->REG2ACFGR), RISC_REGCFGR_PRIV))
#define HAL_RIF_CLEAR_RISAL2_SUBREGB_SREN()               (SEC_CLEAR_BIT((RISC->REG2BCFGR), RISC_REGCFGR_SREN))
#define HAL_RIF_CLEAR_RISAL2_SUBREGB_RLOCK()              (SEC_CLEAR_BIT((RISC->REG2BCFGR), RISC_REGCFGR_RLOCK))
#define HAL_RIF_CLEAR_RISAL2_SUBREGB_SEC()                (SEC_CLEAR_BIT((RISC->REG2BCFGR), RISC_REGCFGR_SEC))
#define HAL_RIF_CLEAR_RISAL2_SUBREGB_PRIV()               (SEC_CLEAR_BIT((RISC->REG2BCFGR), RISC_REGCFGR_PRIV))

#define HAL_RIF_CLEAR_RISAL3_SUBREGA_SREN()               (SEC_CLEAR_BIT((RISC->REG3ACFGR), RISC_REGCFGR_SREN))
#define HAL_RIF_CLEAR_RISAL3_SUBREGA_RLOCK()              (SEC_CLEAR_BIT((RISC->REG3ACFGR), RISC_REGCFGR_RLOCK))
#define HAL_RIF_CLEAR_RISAL3_SUBREGA_SEC()                (SEC_CLEAR_BIT((RISC->REG3ACFGR), RISC_REGCFGR_SEC))
#define HAL_RIF_CLEAR_RISAL3_SUBREGA_PRIV()               (SEC_CLEAR_BIT((RISC->REG3ACFGR), RISC_REGCFGR_PRIV))
#define HAL_RIF_CLEAR_RISAL3_SUBREGB_SREN()               (SEC_CLEAR_BIT((RISC->REG3BCFGR), RISC_REGCFGR_SREN))
#define HAL_RIF_CLEAR_RISAL3_SUBREGB_RLOCK()              (SEC_CLEAR_BIT((RISC->REG3BCFGR), RISC_REGCFGR_RLOCK))
#define HAL_RIF_CLEAR_RISAL3_SUBREGB_SEC()                (SEC_CLEAR_BIT((RISC->REG3BCFGR), RISC_REGCFGR_SEC))
#define HAL_RIF_CLEAR_RISAL3_SUBREGB_PRIV()               (SEC_CLEAR_BIT((RISC->REG3BCFGR), RISC_REGCFGR_PRIV))

/* SRCID */
#define HAL_RIF_READ_RISAL1_SUBREGA_SRCID()               (SEC_READ_BIT((RISC->REG1ACFGR), RISC_REGCFGR_SRCID))
#define HAL_RIF_READ_RISAL1_SUBREGB_SRCID()               (SEC_READ_BIT((RISC->REG1BCFGR), RISC_REGCFGR_SRCID))
#define HAL_RIF_READ_RISAL2_SUBREGA_SRCID()               (SEC_READ_BIT((RISC->REG2ACFGR), RISC_REGCFGR_SRCID))
#define HAL_RIF_READ_RISAL2_SUBREGB_SRCID()               (SEC_READ_BIT((RISC->REG2BCFGR), RISC_REGCFGR_SRCID))
#define HAL_RIF_READ_RISAL3_SUBREGA_SRCID()               (SEC_READ_BIT((RISC->REG3ACFGR), RISC_REGCFGR_SRCID))
#define HAL_RIF_READ_RISAL3_SUBREGB_SRCID()               (SEC_READ_BIT((RISC->REG3BCFGR), RISC_REGCFGR_SRCID))
#define HAL_RIF_IS_RISAL1_SUBREGA_SRCID(srcid)            (HAL_RIF_READ_RISAL1_SUBREGA_SRCID() == srcid ? 1 : 0)
#define HAL_RIF_IS_RISAL1_SUBREGB_SRCID(srcid)            (HAL_RIF_READ_RISAL1_SUBREGB_SRCID() == srcid ? 1 : 0)
#define HAL_RIF_IS_RISAL2_SUBREGA_SRCID(srcid)            (HAL_RIF_READ_RISAL2_SUBREGA_SRCID() == srcid ? 1 : 0)
#define HAL_RIF_IS_RISAL2_SUBREGB_SRCID(srcid)            (HAL_RIF_READ_RISAL2_SUBREGB_SRCID() == srcid ? 1 : 0)
#define HAL_RIF_IS_RISAL3_SUBREGA_SRCID(srcid)            (HAL_RIF_READ_RISAL3_SUBREGA_SRCID() == srcid ? 1 : 0)
#define HAL_RIF_IS_RISAL3_SUBREGB_SRCID(srcid)            (HAL_RIF_READ_RISAL3_SUBREGB_SRCID() == srcid ? 1 : 0)
#define HAL_RIF_SET_RISAL1_SUBREGA_SRCID(srcid)           (SEC_MODIFY_REG((RISC->REG1ACFGR),\
                                                                          RISC_REGCFGR_SRCID_Msk, srcid))
#define HAL_RIF_SET_RISAL1_SUBREGB_SRCID(srcid)           (SEC_MODIFY_REG((RISC->REG1BCFGR),\
                                                                          RISC_REGCFGR_SRCID_Msk, srcid))
#define HAL_RIF_SET_RISAL2_SUBREGA_SRCID(srcid)           (SEC_MODIFY_REG((RISC->REG2ACFGR),\
                                                                          RISC_REGCFGR_SRCID_Msk, srcid))
#define HAL_RIF_SET_RISAL2_SUBREGB_SRCID(srcid)           (SEC_MODIFY_REG((RISC->REG2BCFGR),\
                                                                          RISC_REGCFGR_SRCID_Msk, srcid))
#define HAL_RIF_SET_RISAL3_SUBREGA_SRCID(srcid)           (SEC_MODIFY_REG((RISC->REG3ACFGR),\
                                                                          RISC_REGCFGR_SRCID_Msk, srcid))
#define HAL_RIF_SET_RISAL3_SUBREGB_SRCID(srcid)           (SEC_MODIFY_REG((RISC->REG3BCFGR),\
                                                                          RISC_REGCFGR_SRCID_Msk, srcid))
#define HAL_RIF_CLEAR_RISAL1_SUBREGA_SRCID()              (SEC_MODIFY_REG((RISC->REG1ACFGR),\
                                                                          RISC_REGCFGR_SRCID_Msk,\
                                                                          RISC_REGCFGR_SRCID0))
#define HAL_RIF_CLEAR_RISAL1_SUBREGB_SRCID()              (SEC_MODIFY_REG((RISC->REG1BCFGR),\
                                                                          RISC_REGCFGR_SRCID_Msk,\
                                                                          RISC_REGCFGR_SRCID0))
#define HAL_RIF_CLEAR_RISAL2_SUBREGA_SRCID()              (SEC_MODIFY_REG((RISC->REG2ACFGR),\
                                                                          RISC_REGCFGR_SRCID_Msk,\
                                                                          RISC_REGCFGR_SRCID0))
#define HAL_RIF_CLEAR_RISAL2_SUBREGB_SRCID()              (SEC_MODIFY_REG((RISC->REG2BCFGR),\
                                                                          RISC_REGCFGR_SRCID_Msk,\
                                                                          RISC_REGCFGR_SRCID0))
#define HAL_RIF_CLEAR_RISAL3_SUBREGA_SRCID()              (SEC_MODIFY_REG((RISC->REG3ACFGR),\
                                                                          RISC_REGCFGR_SRCID_Msk,\
                                                                          RISC_REGCFGR_SRCID0))
#define HAL_RIF_CLEAR_RISAL3_SUBREGB_SRCID()              (SEC_MODIFY_REG((RISC->REG3BCFGR),\
                                                                          RISC_REGCFGR_SRCID_Msk,\
                                                                          RISC_REGCFGR_SRCID0))

#endif /* RIF_LPSRAM && RIF_LPSRAM2 && RIF_LPSRAM3 */
/**
  * @brief  RIF private macros to configure RIMC
  */
#define HAL_RIF_READ_RIMC_TDCID()                         (SEC_READ_BIT((RIMC->CR), RIMC_CR_TDCID))
#define HAL_RIF_READ_RIMC_DAPCID()                        (SEC_READ_BIT((RIMC->CR), RIMC_CR_DAPCID))
#define HAL_RIF_READ_RIMC_MCID(masterid)                  (SEC_READ_BIT((RIMC->ATTR[masterid]), RIMC_ATTR_MCID))
#define HAL_RIF_SET_RIMC_TDCID(val)                       (SEC_MODIFY_REG((RIMC->CR), RIMC_CR_TDCID_Msk, val))
#define HAL_RIF_SET_RIMC_DAPCID(val)                      (SEC_MODIFY_REG((RIMC->CR), RIMC_CR_DAPCID_Msk, val))
#define HAL_RIF_SET_RIMC_MCID(masterid,val)               (SEC_MODIFY_REG\
                                                           ((RIMC->ATTR[masterid]), RIMC_ATTR_MCID_Msk, val))
#define HAL_RIF_SET_RIMC_GLOCK()                          (SEC_SET_BIT((RIMC->CR), RIMC_CR_GLOCK))
#define HAL_RIF_SET_RIMC_SEC(masterid)                    (SEC_SET_BIT((RIMC->ATTR[masterid]), RIMC_ATTR_MSEC))
#define HAL_RIF_SET_RIMC_PRIV(masterid)                   (SEC_SET_BIT((RIMC->ATTR[masterid]), RIMC_ATTR_MPRIV))
#define HAL_RIF_SET_RIMC_CIDSEL(masterid)                 (SEC_SET_BIT((RIMC->ATTR[masterid]), RIMC_ATTR_CIDSEL))

#define HAL_RIF_IS_RIMC_SEC(masterid)                     (SEC_READ_BIT((RIMC->ATTR[masterid]), RIMC_ATTR_MSEC))
#define HAL_RIF_IS_RIMC_PRIV(masterid)                    (SEC_READ_BIT((RIMC->ATTR[masterid]), RIMC_ATTR_MPRIV))
#define HAL_RIF_IS_RIMC_CIDSEL(masterid)                  (SEC_READ_BIT((RIMC->ATTR[masterid]), RIMC_ATTR_CIDSEL))
#define HAL_RIF_IS_RIMC_GLOCK()                           (SEC_READ_BIT((RIMC->CR), RIMC_CR_GLOCK))
#define HAL_RIF_IS_RIMC_DDEN()                            (SEC_READ_BIT((RIMC->CR), RIMC_CR_DDEN))

#define HAL_RIF_IS_TRUSTED_DOMAIN(cpu)                    ((HAL_RIF_READ_RIMC_TDCID()) == cpu)
#define HAL_RIF_IS_DEBUG_DOMAIN(cpu)                      (HAL_RIF_IS_RIMC_DDEN() &&\
                                                           ((HAL_RIF_READ_RIMC_DAPCID()) == cpu))

/**
  * @brief  RIF private macros to configure RISAB
  */
/* INSTANCE */
#define HAL_RIF_IS_RISAB_GLOCK(Instance)                            (SEC_READ_BIT\
                                                                     ((((RISAB_TypeDef*)Instance)->CR),\
                                                                      RISAB_CR_GLOCK))
#define HAL_RIF_IS_RISAB_SRWIAD(Instance)                           (SEC_READ_BIT\
                                                                     ((((RISAB_TypeDef*)Instance)->CR),\
                                                                      RISAB_CR_SRWIAD))
/* PAGEID then BLOCKID */
#define HAL_RIF_IS_RISAB_PG_BLOCK_SEC(Instance,pageid,blockid)      (SEC_READ_BIT\
                                                                     ((((RISAB_TypeDef*)Instance)->PGSECCFGR[pageid])\
                                                                      , (1U << blockid) & RISAB_PGSECCFGR_SEC))
#define HAL_RIF_IS_RISAB_PG_BLOCK_PRIV(Instance,pageid,blockid)     (SEC_READ_BIT\
                                                                     ((((RISAB_TypeDef*)Instance)->PGPRIVCFGR[pageid])\
                                                                      , (1U << blockid) & RISAB_PGPRIVCFGR_PRIV))
#define HAL_RIF_IS_RISAB_PG_C2_BLOCK_PRIV(Instance,pageid,blockid)  (SEC_READ_BIT((\
                                                                     ((RISAB_TypeDef*)Instance)->PGC2PRIVCFGR[pageid]),\
                                                                     (1U << blockid) & RISAB_PGC2PRIVCFGR_PRIV))
/* CID then PAGEID */
#define HAL_RIF_IS_RISAB_PG_CX_PRIV(Instance,cid,pageid)    (SEC_READ_BIT\
                                                             ((((RISAB_TypeDef*)(Instance))->CID[(cid)].PRIVCFGR),\
                                                              (1UL << (pageid))))
#define HAL_RIF_IS_RISAB_PG_CX_READ(Instance,cid,pageid)    (SEC_READ_BIT\
                                                             ((((RISAB_TypeDef*)(Instance))->CID[(cid)].RDCFGR),\
                                                              (1UL << (pageid))))
#define HAL_RIF_IS_RISAB_PG_CX_WRITE(Instance,cid,pageid)   (SEC_READ_BIT\
                                                             ((((RISAB_TypeDef*)(Instance))->CID[(cid)].WRCFGR),\
                                                              (1UL << (pageid))))
/* PAGEID */
#define HAL_RIF_IS_RISAB_PG_CFEN(Instance,pageid)           (SEC_READ_BIT\
                                                             ((((RISAB_TypeDef*)Instance)->PGCIDCFGR[pageid]),\
                                                              RISAB_PGCIDCFGR_CFEN))
#define HAL_RIF_IS_RISAB_PG_DCEN(Instance,pageid)           (SEC_READ_BIT\
                                                             ((((RISAB_TypeDef*)Instance)->PGCIDCFGR[pageid]),\
                                                              RISAB_PGCIDCFGR_DCEN))
#define HAL_RIF_IS_RISAB_PG_LOCK(Instance,pageid)           (SEC_READ_BIT\
                                                             ((((RISAB_TypeDef*)(Instance))->RIFLOCKR),\
                                                              (1UL << (pageid))))

/* INSTANCE */
#define HAL_RIF_SET_RISAB_GLOCK(Instance)                                 (SEC_SET_BIT\
                                                                           ((((RISAB_TypeDef*)Instance)->CR),\
                                                                            RISAB_CR_GLOCK))
#define HAL_RIF_SET_RISAB_SRWIAD(Instance)                                (SEC_SET_BIT\
                                                                           ((((RISAB_TypeDef*)Instance)->CR),\
                                                                            RISAB_CR_SRWIAD))
#define HAL_RIF_SET_RISAB_LOCK(Instance)                                  (SEC_SET_BIT\
                                                                           ((((RISAB_TypeDef*)Instance)->RIFLOCKR),\
                                                                            RISAB_RIFLOCKR_RLOCK))
/* PAGEID then BLOCKID */
#define HAL_RIF_SET_RISAB_PG_BLOCK_SEC(Instance,pageid,blockid)     (SEC_SET_BIT(((\
                                                                     (RISAB_TypeDef*)Instance)->PGSECCFGR[pageid]),\
                                                                     ((1U << blockid) & RISAB_PGSECCFGR_SEC))
#define HAL_RIF_SET_RISAB_PG_BLOCK_PRIV(Instance,pageid,blockid)    (SEC_SET_BIT((\
                                                                     ((RISAB_TypeDef*)Instance)->PGPRIVCFGR[pageid]),\
                                                                     ((1U << blockid) & RISAB_PGPRIVCFGR_PRIV))
#define HAL_RIF_SET_RISAB_PG_C2_BLOCK_PRIV(Instance,pageid,blockid) (SEC_SET_BIT(((\
                                                                     (RISAB_TypeDef*)Instance)->PGC2PRIVCFGR[pageid]),\
                                                                     ((1U << blockid) & RISAB_PGC2PRIVCFGR_PRIV))
/* PAGEID */
#define HAL_RIF_SET_RISAB_PG_SEC(Instance,pageid)               (SEC_SET_BIT\
                                                                 ((((RISAB_TypeDef*)Instance)->PGSECCFGR[pageid]),\
                                                                  RISAB_PGSECCFGR_SEC))
#define HAL_RIF_SET_RISAB_PG_PRIV(Instance,pageid)              (SEC_SET_BIT\
                                                                 ((((RISAB_TypeDef*)Instance)->PGPRIVCFGR[pageid]),\
                                                                  RISAB_PGPRIVCFGR_PRIV))
#define HAL_RIF_SET_RISAB_PG_C2_PRIV(Instance,pageid)           (SEC_SET_BIT\
                                                                 ((((RISAB_TypeDef*)Instance)->PGC2PRIVCFGR[pageid]),\
                                                                  RISAB_PGC2PRIVCFGR_PRIV))
#define HAL_RIF_SET_RISAB_PG_CFEN(Instance,pageid)              (SEC_SET_BIT\
                                                                 ((((RISAB_TypeDef*)Instance)->PGCIDCFGR[pageid]),\
                                                                  RISAB_PGCIDCFGR_CFEN))
#define HAL_RIF_SET_RISAB_PG_DCEN(Instance,pageid)              (SEC_SET_BIT\
                                                                 ((((RISAB_TypeDef*)Instance)->PGCIDCFGR[pageid]),\
                                                                  RISAB_PGCIDCFGR_DCEN))
#define HAL_RIF_SET_RISAB_PG_LOCK(Instance,pageid)              (SEC_SET_BIT\
                                                                 ((((RISAB_TypeDef*)Instance)->RIFLOCKR),\
                                                                  (1U << pageid)))
/* CID */
#define HAL_RIF_SET_RISAB_CX_PRIV(Instance,cid)                 (SEC_SET_BIT\
                                                                 ((((RISAB_TypeDef*)Instance)->CID[cid].PRIVCFGR),\
                                                                  RISAB_CIDPRIVCFGR_PPRIV))
#define HAL_RIF_SET_RISAB_CX_READ(Instance,cid)                 (SEC_SET_BIT\
                                                                 ((((RISAB_TypeDef*)Instance)->CID[cid].RDCFGR),\
                                                                  RISAB_CIDRDCFGR_PRDEN))
#define HAL_RIF_SET_RISAB_CX_WRITE(Instance,cid)                (SEC_SET_BIT\
                                                                 ((((RISAB_TypeDef*)Instance)->CID[cid].WRCFGR),\
                                                                  RISAB_CIDRDCFGR_PWREN))
/* CID then PAGEID */
#define HAL_RIF_SET_RISAB_PG_CX_PRIV(Instance,cid,pageid)       (SEC_SET_BIT\
                                                                 ((((RISAB_TypeDef*)Instance)->CID[cid].PRIVCFGR),\
                                                                  (1U << pageid)))
#define HAL_RIF_SET_RISAB_PG_CX_READ(Instance,cid,pageid)       (SEC_SET_BIT\
                                                                 ((((RISAB_TypeDef*)Instance)->CID[cid].RDCFGR),\
                                                                  (1U << pageid)))
#define HAL_RIF_SET_RISAB_PG_CX_WRITE(Instance,cid,pageid)      (SEC_SET_BIT\
                                                                 ((((RISAB_TypeDef*)Instance)->CID[cid].WRCFGR),\
                                                                  (1U << pageid)))

