zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_hal_rif.h
/* INSTANCE */
#define HAL_RIF_CLEAR_RISAB_SRWIAD(Instance)                          (SEC_CLEAR_BIT\
                                                                       ((((RISAB_TypeDef*)Instance)->CR),\
                                                                        RISAB_CR_SRWIAD))
#define HAL_RIF_CLEAR_RISAB_LOCK(Instance)                            (SEC_CLEAR_BIT\
                                                                       ((((RISAB_TypeDef*)Instance)->RIFLOCKR),\
                                                                        RISAB_RIFLOCKR_RLOCK))
/* PAGEID then BLOCKID */
#define HAL_RIF_CLEAR_RISAB_PG_BLOCK_SEC(Instance,pageid,blockid)     (SEC_CLEAR_BIT(((\
                                                                       (RISAB_TypeDef*)Instance)->PGSECCFGR[pageid]),\
                                                                       (1U << blockid) & RISAB_PGSECCFGR_SEC))
#define HAL_RIF_CLEAR_RISAB_PG_BLOCK_PRIV(Instance,pageid,blockid)    (SEC_CLEAR_BIT(((\
                                                                       (RISAB_TypeDef*)Instance)->PGPRIVCFGR[pageid]),\
                                                                       (1U << blockid) & RISAB_PGPRIVCFGR_PRIV))
#define HAL_RIF_CLEAR_RISAB_PG_C2_BLOCK_PRIV(Instance,pageid,blockid) (SEC_CLEAR_BIT\
                                                                       ((((RISAB_TypeDef*)Instance)\
                                                                         ->PGC2PRIVCFGR[pageid]), \
                                                                        (1U << blockid) & RISAB_PGC2PRIVCFGR_PRIV))
/* PAGEID */
#define HAL_RIF_CLEAR_RISAB_PG_SEC(Instance,pageid)             (SEC_CLEAR_BIT\
                                                                 ((((RISAB_TypeDef*)Instance)->PGSECCFGR[pageid]),\
                                                                  RISAB_PGSECCFGR_SEC))
#define HAL_RIF_CLEAR_RISAB_PG_PRIV(Instance,pageid)            (SEC_CLEAR_BIT\
                                                                 ((((RISAB_TypeDef*)Instance)->PGPRIVCFGR[pageid]),\
                                                                  RISAB_PGPRIVCFGR_PRIV))
#define HAL_RIF_CLEAR_RISAB_PG_C2_PRIV(Instance,pageid)         (SEC_CLEAR_BIT\
                                                                 ((((RISAB_TypeDef*)Instance)->PGC2PRIVCFGR[pageid]),\
                                                                  RISAB_PGC2PRIVCFGR_PRIV))
#define HAL_RIF_CLEAR_RISAB_PG_CFEN(Instance,pageid)            (SEC_CLEAR_BIT\
                                                                 ((((RISAB_TypeDef*)Instance)->PGCIDCFGR[pageid]),\
                                                                  RISAB_PGCIDCFGR_CFEN))
#define HAL_RIF_CLEAR_RISAB_PG_DCEN(Instance,pageid)            (SEC_CLEAR_BIT\
                                                                 ((((RISAB_TypeDef*)Instance)->PGCIDCFGR[pageid]),\
                                                                  RISAB_PGCIDCFGR_DCEN))
#define HAL_RIF_CLEAR_RISAB_PG_LOCK(Instance,pageid)            (SEC_CLEAR_BIT\
                                                                 ((((RISAB_TypeDef*)Instance)->RIFLOCKR),\
                                                                  (1U << pageid)))
/* CID */
#define HAL_RIF_CLEAR_RISAB_CX_PRIV(Instance,cid)               (SEC_CLEAR_BIT\
                                                                 ((((RISAB_TypeDef*)Instance)->CID[cid].PRIVCFGR),\
                                                                  RISAB_CIDPRIVCFGR_PPRIV))
#define HAL_RIF_CLEAR_RISAB_CX_READ(Instance,cid)               (SEC_CLEAR_BIT\
                                                                 ((((RISAB_TypeDef*)Instance)->CID[cid].RDCFGR),\
                                                                  RISAB_CIDRDCFGR_PRDEN))
#define HAL_RIF_CLEAR_RISAB_CX_WRITE(Instance,cid)              (SEC_CLEAR_BIT\
                                                                 ((((RISAB_TypeDef*)Instance)->CID[cid].WRCFGR),\
                                                                  RISAB_CIDRDCFGR_PWREN))
/* CID then PAGEID */
#define HAL_RIF_CLEAR_RISAB_PG_CX_PRIV(Instance,cid,pageid)     (SEC_CLEAR_BIT\
                                                                 ((((RISAB_TypeDef*)Instance)->CID[cid].PRIVCFGR),\
                                                                  (1U << pageid)))
#define HAL_RIF_CLEAR_RISAB_PG_CX_READ(Instance,cid,pageid)     (SEC_CLEAR_BIT\
                                                                 ((((RISAB_TypeDef*)Instance)->CID[cid].RDCFGR),\
                                                                  (1U << pageid)))
#define HAL_RIF_CLEAR_RISAB_PG_CX_WRITE(Instance,cid,pageid)    (SEC_CLEAR_BIT\
                                                                 ((((RISAB_TypeDef*)Instance)->CID[cid].WRCFGR),\
                                                                  (1U << pageid)))

/* PAGEID */
#define HAL_RIF_READ_RISAB_PG_SEC(Instance,pageid)              (SEC_READ_BIT\
                                                                 ((((RISAB_TypeDef*)Instance)->PGSECCFGR[pageid]),\
                                                                  RISAB_PGSECCFGR_SEC))
#define HAL_RIF_READ_RISAB_PG_PRIV(Instance,pageid)             (SEC_READ_BIT\
                                                                 ((((RISAB_TypeDef*)Instance)->PGPRIVCFGR[pageid]),\
                                                                  RISAB_PGPRIVCFGR_PRIV))
#define HAL_RIF_READ_RISAB_PG_C2_PRIV(Instance,pageid)          (SEC_READ_BIT\
                                                                 ((((RISAB_TypeDef*)Instance)->PGC2PRIVCFGR[pageid]),\
                                                                  RISAB_PGC2PRIVCFGR_PRIV))
/* CID */
#define HAL_RIF_READ_RISAB_CX_PRIV(Instance,cid)                (SEC_READ_BIT\
                                                                 ((((RISAB_TypeDef*)Instance)->CID[cid].PRIVCFGR),\
                                                                  RISAB_CIDPRIVCFGR_PPRIV))
#define HAL_RIF_READ_RISAB_CX_READ(Instance,cid)                (SEC_READ_BIT\
                                                                 ((((RISAB_TypeDef*)Instance)->CID[cid].RDCFGR),\
                                                                  RISAB_CIDRDCFGR_PRDEN))
#define HAL_RIF_READ_RISAB_CX_WRITE(Instance,cid)               (SEC_READ_BIT\
                                                                 ((((RISAB_TypeDef*)Instance)->CID[cid].WRCFGR),\
                                                                  RISAB_CIDRDCFGR_PWREN))
/* Per CID then PAGEID */
#define HAL_RIF_READ_RISAB_PG_CX_PRIV(Instance,cid,pageid)      (SEC_READ_BIT\
                                                                 ((((RISAB_TypeDef*)Instance)->CID[cid].PRIVCFGR),\
                                                                  (1U << pageid)))
#define HAL_RIF_READ_RISAB_PG_CX_READ(Instance,cid,pageid)      (SEC_READ_BIT\
                                                                 ((((RISAB_TypeDef*)Instance)->CID[cid].RDCFGR),\
                                                                  (1U << pageid)))
#define HAL_RIF_READ_RISAB_PG_CX_WRITE(Instance,cid,pageid)     (SEC_READ_BIT\
                                                                 ((((RISAB_TypeDef*)Instance)->CID[cid].WRCFGR),\
                                                                  (1U << pageid)))

/* DCCID */
#define HAL_RIF_READ_RISAB_PG_DCCID(Instance,pageid)        (SEC_READ_BIT\
                                                             ((((RISAB_TypeDef*)Instance)->PGCIDCFGR[pageid]),\
                                                              RISAB_PGCIDCFGR_DCCID))
#define HAL_RIF_IS_RISAB_PG_DCCID(Instance,pageid,cid)      (HAL_RIF_READ_RISAB_PG_DCCID\
                                                             (Instance,pageid) == cid ? 1 : 0)
#define HAL_RIF_SET_RISAB_PG_DCCID(Instance,pageid,val)     (SEC_MODIFY_REG\
                                                             ((((RISAB_TypeDef*)Instance)->PGCIDCFGR[pageid]),\
                                                              RISAB_PGCIDCFGR_DCCID_Msk, val))

/* ILLEGAL ACCESS */
#define HAL_RIF_READ_RISAB_IASR(Instance)                   (SEC_READ_REG\
                                                             ((((RISAB_TypeDef*)Instance)->IASR)))
#define HAL_RIF_READ_RISAB_IAESR(Instance)                  (SEC_READ_REG\
                                                             ((((RISAB_TypeDef*)Instance)->IAESR)))
#define HAL_RIF_READ_RISAB_IADDR(Instance)                  (SEC_READ_REG\
                                                             ((((RISAB_TypeDef*)Instance)->IADDR)))
#define HAL_RIF_CLEAR_RISAB_IACR_CAEF(Instance)             (SEC_SET_BIT\
                                                             ((((RISAB_TypeDef*)Instance)->IACR),\
                                                              RISAB_IACR_CAEF))
#define HAL_RIF_CLEAR_RISAB_IACR_IAEF(Instance)             (SEC_SET_BIT\
                                                             ((((RISAB_TypeDef*)Instance)->IACR),\
                                                              RISAB_IACR_IAEF))
#define HAL_RIF_CLEAR_RISAB_IACR(Instance)                  (SEC_SET_BIT\
                                                             ((((RISAB_TypeDef*)Instance)->IACR),\
                                                              RISAB_IACR_CAEF|RISAB_IACR_IAEF))
#define HAL_RIF_IS_RISAB_IASR_CAEF(Instance)                (SEC_READ_BIT\
                                                             ((((RISAB_TypeDef*)Instance)->IASR), RISAB_IASR_CAEF))
#define HAL_RIF_IS_RISAB_IASR_IAEF(Instance)                (SEC_READ_BIT\
                                                             ((((RISAB_TypeDef*)Instance)->IASR), RISAB_IASR_IAEF))
#define HAL_RIF_IS_RISAB_IAESR_IAPRIV(Instance)             (SEC_READ_BIT\
                                                             ((((RISAB_TypeDef*)Instance)->IAESR), RISAB_IAESR_IAPRIV))
#define HAL_RIF_IS_RISAB_IAESR_IASEC(Instance)              (SEC_READ_BIT\
                                                             ((((RISAB_TypeDef*)Instance)->IAESR), RISAB_IAESR_IASEC))
#define HAL_RIF_IS_RISAB_IAESR_IANRW(Instance)              (SEC_READ_BIT\
                                                             ((((RISAB_TypeDef*)Instance)->IAESR), RISAB_IAESR_IANRW))
#define HAL_RIF_READ_RISAB_IAESR_IACID(Instance)            (SEC_READ_BIT\
                                                             ((((RISAB_TypeDef*)Instance)->IAESR),\
                                                              RISAB_IAESR_IACID) >> RISAB_IAESR_IACID_Pos)

/**
  * @brief  RIF private macros to configure RISAF
  */
/* INSTANCE */
#define HAL_RIF_IS_RISAF_GLOCK(Instance)                                  (SEC_READ_BIT\
                                                                           ((((RISAF_TypeDef*)Instance)->CR),\
                                                                            RISAF_CR_GLOCK))
#define HAL_RIF_IS_RISAF_KEYRDY(Instance)                                 (SEC_READ_BIT\
                                                                           ((((RISAF_TypeDef*)Instance)->SR),\
                                                                            RISAF_SR_KEYRDY))
#define HAL_RIF_IS_RISAF_KEYVALID(Instance)                               (SEC_READ_BIT\
                                                                           ((((RISAF_TypeDef*)Instance)->SR),\
                                                                            RISAF_SR_KEYVALID))

#define HAL_RIF_SET_RISAF_GLOCK(Instance)                                 (SEC_SET_BIT\
                                                                           ((((RISAF_TypeDef*)Instance)->CR),\
                                                                            RISAF_CR_GLOCK))

#define HAL_RIF_READ_RISAF_CR(Instance)                                   (SEC_READ_REG\
                                                                           ((((RISAF_TypeDef*)Instance)->CR)))
#define HAL_RIF_READ_RISAF_SR(Instance)                                   (SEC_READ_REG\
                                                                           ((((RISAF_TypeDef*)Instance)->SR)))

