zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_hal_rif.h
/* REGIONID */
#define HAL_RIF_SET_RISAF_REG_BREN(Instance,regionid)           (SEC_SET_BIT\
                                                                 ((((RISAF_TypeDef*)Instance)->REG[regionid].CFGR),\
                                                                  RISAF_REGCFGR_BREN))
#define HAL_RIF_SET_RISAF_REG_SEC(Instance,regionid)            (SEC_SET_BIT\
                                                                 ((((RISAF_TypeDef*)Instance)->REG[regionid].CFGR),\
                                                                  RISAF_REGCFGR_SEC))
#define HAL_RIF_SET_RISAF_REG_ENC(Instance,regionid)            (SEC_SET_BIT\
                                                                 ((((RISAF_TypeDef*)Instance)->REG[regionid].CFGR),\
                                                                  RISAF_REGCFGR_ENC))
#define HAL_RIF_SET_RISAF_REG_CIDPRIV(Instance,regionid,cid)    (SEC_SET_BIT\
                                                                 ((((RISAF_TypeDef*)Instance)->REG[regionid].CFGR),\
                                                                  cid))
#define HAL_RIF_SET_RISAF_REG_CIDREAD(Instance,regionid,cid)    (SEC_SET_BIT\
                                                                 ((((RISAF_TypeDef*)Instance)->REG[regionid].CIDCFGR),\
                                                                  cid))
#define HAL_RIF_SET_RISAF_REG_CIDWRITE(Instance,regionid,cid)   (SEC_SET_BIT\
                                                                 ((((RISAF_TypeDef*)Instance)->REG[regionid].CIDCFGR),\
                                                                  cid))
#define HAL_RIF_SET_RISAF_REG_STARTR(Instance,regionid,addr)    (SEC_SET_BIT\
                                                                 ((((RISAF_TypeDef*)Instance)->REG[regionid].STARTR),\
                                                                  addr))
#define HAL_RIF_SET_RISAF_REG_ENDR(Instance,regionid,addr)      (SEC_SET_BIT\
                                                                 ((((RISAF_TypeDef*)Instance)->REG[regionid].ENDR),\
                                                                  addr))

#define HAL_RIF_CLEAR_RISAF_REG_BREN(Instance,regionid)         (SEC_CLEAR_BIT\
                                                                 ((((RISAF_TypeDef*)Instance)->REG[regionid].CFGR),\
                                                                  RISAF_REGCFGR_BREN))
#define HAL_RIF_CLEAR_RISAF_REG_SEC(Instance,regionid)          (SEC_CLEAR_BIT\
                                                                 ((((RISAF_TypeDef*)Instance)->REG[regionid].CFGR),\
                                                                  RISAF_REGCFGR_SEC))
#define HAL_RIF_CLEAR_RISAF_REG_ENC(Instance,regionid)          (SEC_CLEAR_BIT\
                                                                 ((((RISAF_TypeDef*)Instance)->REG[regionid].CFGR),\
                                                                  RISAF_REGCFGR_ENC))
#define HAL_RIF_CLEAR_RISAF_REG_CIDPRIV(Instance,regionid,cid)  (SEC_CLEAR_BIT\
                                                                 ((((RISAF_TypeDef*)Instance)->REG[regionid].CFGR),\
                                                                  cid))
#define HAL_RIF_CLEAR_RISAF_REG_CIDREAD(Instance,regionid,cid)  (SEC_CLEAR_BIT\
                                                                 ((((RISAF_TypeDef*)Instance)->REG[regionid].CIDCFGR),\
                                                                  cid))
#define HAL_RIF_CLEAR_RISAF_REG_CIDWRITE(Instance,regionid,cid) (SEC_CLEAR_BIT\
                                                                 ((((RISAF_TypeDef*)Instance)->REG[regionid].CIDCFGR),\
                                                                  cid))

#define HAL_RIF_READ_RISAF_CFGR(Instance,regionid)              (SEC_READ_REG\
                                                                 ((((RISAF_TypeDef*)Instance)->REG[regionid].CFGR)))
#define HAL_RIF_READ_RISAF_STARTR(Instance,regionid)            (SEC_READ_REG\
                                                                 ((((RISAF_TypeDef*)Instance)->REG[regionid].STARTR)))
#define HAL_RIF_READ_RISAF_ENDR(Instance,regionid)              (SEC_READ_REG\
                                                                 ((((RISAF_TypeDef*)Instance)->REG[regionid].ENDR)))
#define HAL_RIF_READ_RISAF_CIDCFGR(Instance,regionid)           (SEC_READ_REG\
                                                                 ((((RISAF_TypeDef*)Instance)->REG[regionid].CIDCFGR)))
#define HAL_RIF_READ_RISAF_REG_CIDPRIV(Instance,regionid)       (SEC_READ_BIT\
                                                                 ((((RISAF_TypeDef*)Instance)->REG[regionid].CFGR),\
                                                                  RISAF_REGCFGR_PRIV))
#define HAL_RIF_READ_RISAF_REG_CIDREAD(Instance,regionid)       (SEC_READ_BIT\
                                                                 ((((RISAF_TypeDef*)Instance)->REG[regionid].CIDCFGR),\
                                                                  RISAF_REGCIDCFGR_RDEN))
#define HAL_RIF_READ_RISAF_REG_CIDWRITE(Instance,regionid)      (SEC_READ_BIT\
                                                                 ((((RISAF_TypeDef*)Instance)->REG[regionid].CIDCFGR),\
                                                                  RISAF_REGCIDCFGR_WREN))

#define HAL_RIF_IS_RISAF_REG_BREN(Instance,regionid)            (SEC_READ_BIT\
                                                                 ((((RISAF_TypeDef*)Instance)->REG[regionid].CFGR),\
                                                                  RISAF_REGCFGR_BREN))
#define HAL_RIF_IS_RISAF_REG_SEC(Instance,regionid)             (SEC_READ_BIT\
                                                                 ((((RISAF_TypeDef*)Instance)->REG[regionid].CFGR),\
                                                                  RISAF_REGCFGR_SEC))
#define HAL_RIF_IS_RISAF_REG_ENC(Instance,regionid)             (SEC_READ_BIT\
                                                                 ((((RISAF_TypeDef*)Instance)->REG[regionid].CFGR),\
                                                                  RISAF_REGCFGR_ENC))
#define HAL_RIF_IS_RISAF_REG_CIDPRIV(Instance,regionid,cid)     ((HAL_RIF_READ_RISAF_REG_CIDPRIV\
                                                                  (Instance,regionid)&cid) == cid ? 1 : 0)
#define HAL_RIF_IS_RISAF_REG_CIDREAD(Instance,regionid,cid)     ((HAL_RIF_READ_RISAF_REG_CIDREAD\
                                                                  (Instance,regionid)&cid) == cid ? 1 : 0)
#define HAL_RIF_IS_RISAF_REG_CIDWRITE(Instance,regionid,cid)    ((HAL_RIF_READ_RISAF_REG_CIDWRITE\
                                                                  (Instance,regionid)&cid) == cid ? 1 : 0)

