zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_hal_rif.h
/* SUBREGION */
#define HAL_RIF_IS_RISAF_SUBREGA_SREN(Instance,regionid)        (SEC_READ_BIT\
                                                                 ((((RISAF_TypeDef*)Instance)->REG[regionid].ACFGR),\
                                                                  RISAF_REGZCFGR_SREN))
#define HAL_RIF_IS_RISAF_SUBREGA_RLOCK(Instance,regionid)       (SEC_READ_BIT\
                                                                 ((((RISAF_TypeDef*)Instance)->REG[regionid].ACFGR),\
                                                                  RISAF_REGZCFGR_RLOCK))
#define HAL_RIF_IS_RISAF_SUBREGA_SEC(Instance,regionid)         (SEC_READ_BIT\
                                                                 ((((RISAF_TypeDef*)Instance)->REG[regionid].ACFGR),\
                                                                  RISAF_REGZCFGR_SEC))
#define HAL_RIF_IS_RISAF_SUBREGA_PRIV(Instance,regionid)        (SEC_READ_BIT\
                                                                 ((((RISAF_TypeDef*)Instance)->REG[regionid].ACFGR),\
                                                                  RISAF_REGZCFGR_PRIV))
#define HAL_RIF_IS_RISAF_SUBREGA_RDEN(Instance,regionid)        (SEC_READ_BIT\
                                                                 ((((RISAF_TypeDef*)Instance)->REG[regionid].ACFGR),\
                                                                  RISAF_REGZCFGR_RDEN))
#define HAL_RIF_IS_RISAF_SUBREGA_WREN(Instance,regionid)        (SEC_READ_BIT\
                                                                 ((((RISAF_TypeDef*)Instance)->REG[regionid].ACFGR),\
                                                                  RISAF_REGZCFGR_WREN))
#define HAL_RIF_IS_RISAF_SUBREGA_ENC(Instance,regionid)         (SEC_READ_BIT\
                                                                 ((((RISAF_TypeDef*)Instance)->REG[regionid].ACFGR),\
                                                                  RISAF_REGZCFGR_ENC))
#define HAL_RIF_IS_RISAF_SUBREGA_DCEN(Instance,regionid)        (SEC_READ_BIT\
                                                                 ((((RISAF_TypeDef*)Instance)->REG[regionid].ANESTR),\
                                                                  RISAF_REGZNESTR_DCEN))
#define HAL_RIF_IS_RISAF_SUBREGB_SREN(Instance,regionid)        (SEC_READ_BIT\
                                                                 ((((RISAF_TypeDef*)Instance)->REG[regionid].BCFGR),\
                                                                  RISAF_REGZCFGR_SREN))
#define HAL_RIF_IS_RISAF_SUBREGB_RLOCK(Instance,regionid)       (SEC_READ_BIT\
                                                                 ((((RISAF_TypeDef*)Instance)->REG[regionid].BCFGR),\
                                                                  RISAF_REGZCFGR_RLOCK))
#define HAL_RIF_IS_RISAF_SUBREGB_SEC(Instance,regionid)         (SEC_READ_BIT\
                                                                 ((((RISAF_TypeDef*)Instance)->REG[regionid].BCFGR),\
                                                                  RISAF_REGZCFGR_SEC))
#define HAL_RIF_IS_RISAF_SUBREGB_PRIV(Instance,regionid)        (SEC_READ_BIT\
                                                                 ((((RISAF_TypeDef*)Instance)->REG[regionid].BCFGR),\
                                                                  RISAF_REGZCFGR_PRIV))
#define HAL_RIF_IS_RISAF_SUBREGB_RDEN(Instance,regionid)        (SEC_READ_BIT\
                                                                 ((((RISAF_TypeDef*)Instance)->REG[regionid].BCFGR),\
                                                                  RISAF_REGZCFGR_RDEN))
#define HAL_RIF_IS_RISAF_SUBREGB_WREN(Instance,regionid)        (SEC_READ_BIT\
                                                                 ((((RISAF_TypeDef*)Instance)->REG[regionid].BCFGR),\
                                                                  RISAF_REGZCFGR_WREN))
#define HAL_RIF_IS_RISAF_SUBREGB_ENC(Instance,regionid)         (SEC_READ_BIT\
                                                                 ((((RISAF_TypeDef*)Instance)->REG[regionid].BCFGR),\
                                                                  RISAF_REGZCFGR_ENC))
#define HAL_RIF_IS_RISAF_SUBREGB_DCEN(Instance,regionid)        (SEC_READ_BIT\
                                                                 ((((RISAF_TypeDef*)Instance)->REG[regionid].BNESTR),\
                                                                  RISAF_REGZNESTR_DCEN))

#define HAL_RIF_SET_RISAF_SUBREGA_SREN(Instance,regionid)        (SEC_SET_BIT\
                                                                  ((((RISAF_TypeDef*)Instance)->REG[regionid].ACFGR),\
                                                                   RISAF_REGZCFGR_SREN))
#define HAL_RIF_SET_RISAF_SUBREGA_RLOCK(Instance,regionid)       (SEC_SET_BIT\
                                                                  ((((RISAF_TypeDef*)Instance)->REG[regionid].ACFGR),\
                                                                   RISAF_REGZCFGR_RLOCK))
#define HAL_RIF_SET_RISAF_SUBREGA_SEC(Instance,regionid)         (SEC_SET_BIT\
                                                                  ((((RISAF_TypeDef*)Instance)->REG[regionid].ACFGR),\
                                                                   RISAF_REGZCFGR_SEC))
#define HAL_RIF_SET_RISAF_SUBREGA_PRIV(Instance,regionid)        (SEC_SET_BIT\
                                                                  ((((RISAF_TypeDef*)Instance)->REG[regionid].ACFGR),\
                                                                   RISAF_REGZCFGR_PRIV))
#define HAL_RIF_SET_RISAF_SUBREGA_RDEN(Instance,regionid)        (SEC_SET_BIT\
                                                                  ((((RISAF_TypeDef*)Instance)->REG[regionid].ACFGR),\
                                                                   RISAF_REGZCFGR_RDEN))
#define HAL_RIF_SET_RISAF_SUBREGA_WREN(Instance,regionid)        (SEC_SET_BIT\
                                                                  ((((RISAF_TypeDef*)Instance)->REG[regionid].ACFGR),\
                                                                   RISAF_REGZCFGR_WREN))
#define HAL_RIF_SET_RISAF_SUBREGA_DCEN(Instance,regionid)        (SEC_SET_BIT\
                                                                  ((((RISAF_TypeDef*)Instance)->REG[regionid].ANESTR),\
                                                                   RISAF_REGZNESTR_DCEN))
#define HAL_RIF_SET_RISAF_SUBREGA_STARTR(Instance,regionid,addr) (SEC_SET_BIT\
                                                                  ((((RISAF_TypeDef*)Instance)->REG[regionid].ASTARTR)\
                                                                   , addr))
#define HAL_RIF_SET_RISAF_SUBREGA_ENDR(Instance,regionid,addr)   (SEC_SET_BIT\
                                                                  ((((RISAF_TypeDef*)Instance)->REG[regionid].AENDR),\
                                                                   addr))
#define HAL_RIF_SET_RISAF_SUBREGB_SREN(Instance,regionid)        (SEC_SET_BIT\
                                                                  ((((RISAF_TypeDef*)Instance)->REG[regionid].BCFGR),\
                                                                   RISAF_REGZCFGR_SREN))
#define HAL_RIF_SET_RISAF_SUBREGB_RLOCK(Instance,regionid)       (SEC_SET_BIT\
                                                                  ((((RISAF_TypeDef*)Instance)->REG[regionid].BCFGR),\
                                                                   RISAF_REGZCFGR_RLOCK))
#define HAL_RIF_SET_RISAF_SUBREGB_SEC(Instance,regionid)         (SEC_SET_BIT\
                                                                  ((((RISAF_TypeDef*)Instance)->REG[regionid].BCFGR),\
                                                                   RISAF_REGZCFGR_SEC))
#define HAL_RIF_SET_RISAF_SUBREGB_PRIV(Instance,regionid)        (SEC_SET_BIT\
                                                                  ((((RISAF_TypeDef*)Instance)->REG[regionid].BCFGR),\
                                                                   RISAF_REGZCFGR_PRIV))
#define HAL_RIF_SET_RISAF_SUBREGB_RDEN(Instance,regionid)        (SEC_SET_BIT\
                                                                  ((((RISAF_TypeDef*)Instance)->REG[regionid].BCFGR),\
                                                                   RISAF_REGZCFGR_RDEN))
#define HAL_RIF_SET_RISAF_SUBREGB_WREN(Instance,regionid)        (SEC_SET_BIT\
                                                                  ((((RISAF_TypeDef*)Instance)->REG[regionid].BCFGR),\
                                                                   RISAF_REGZCFGR_WREN))
#define HAL_RIF_SET_RISAF_SUBREGB_ENC(Instance,regionid)         (SEC_SET_BIT\
                                                                  ((((RISAF_TypeDef*)Instance)->REG[regionid].BCFGR),\
                                                                   RISAF_REGZCFGR_ENC))
#define HAL_RIF_SET_RISAF_SUBREGB_DCEN(Instance,regionid)        (SEC_SET_BIT\
                                                                  ((((RISAF_TypeDef*)Instance)->REG[regionid].BNESTR),\
                                                                   RISAF_REGZNESTR_DCEN))
#define HAL_RIF_SET_RISAF_SUBREGB_STARTR(Instance,regionid,addr) (SEC_SET_BIT\
                                                                  ((((RISAF_TypeDef*)Instance)->REG[regionid].BSTARTR),\
                                                                   addr))
#define HAL_RIF_SET_RISAF_SUBREGB_ENDR(Instance,regionid,addr)   (SEC_SET_BIT\
                                                                  ((((RISAF_TypeDef*)Instance)->REG[regionid].BENDR),\
                                                                   addr))

