zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_hal_rif.h
#define HAL_RIF_CLEAR_RISAF_SUBREGA_SREN(Instance,regionid)     (SEC_CLEAR_BIT\
                                                                 ((((RISAF_TypeDef*)Instance)->REG[regionid].ACFGR),\
                                                                  RISAF_REGZCFGR_SREN))
#define HAL_RIF_CLEAR_RISAF_SUBREGA_SEC(Instance,regionid)      (SEC_CLEAR_BIT\
                                                                 ((((RISAF_TypeDef*)Instance)->REG[regionid].ACFGR),\
                                                                  RISAF_REGZCFGR_SEC))
#define HAL_RIF_CLEAR_RISAF_SUBREGA_PRIV(Instance,regionid)     (SEC_CLEAR_BIT\
                                                                 ((((RISAF_TypeDef*)Instance)->REG[regionid].ACFGR),\
                                                                  RISAF_REGZCFGR_PRIV))
#define HAL_RIF_CLEAR_RISAF_SUBREGA_RDEN(Instance,regionid)     (SEC_CLEAR_BIT\
                                                                 ((((RISAF_TypeDef*)Instance)->REG[regionid].ACFGR),\
                                                                  RISAF_REGZCFGR_RDEN))
#define HAL_RIF_CLEAR_RISAF_SUBREGA_WREN(Instance,regionid)     (SEC_CLEAR_BIT\
                                                                 ((((RISAF_TypeDef*)Instance)->REG[regionid].ACFGR),\
                                                                  RISAF_REGZCFGR_WREN))
#define HAL_RIF_CLEAR_RISAF_SUBREGA_ENC(Instance,regionid)      (SEC_CLEAR_BIT\
                                                                 ((((RISAF_TypeDef*)Instance)->REG[regionid].ACFGR),\
                                                                  RISAF_REGZCFGR_ENC))
#define HAL_RIF_CLEAR_RISAF_SUBREGA_DCEN(Instance,regionid)     (SEC_CLEAR_BIT\
                                                                 ((((RISAF_TypeDef*)Instance)->REG[regionid].ANESTR),\
                                                                  RISAF_REGZNESTR_DCEN))
#define HAL_RIF_CLEAR_RISAF_SUBREGB_SREN(Instance,regionid)     (SEC_CLEAR_BIT\
                                                                 ((((RISAF_TypeDef*)Instance)->REG[regionid].BCFGR),\
                                                                  RISAF_REGZCFGR_SREN))
#define HAL_RIF_CLEAR_RISAF_SUBREGB_SEC(Instance,regionid)      (SEC_CLEAR_BIT\
                                                                 ((((RISAF_TypeDef*)Instance)->REG[regionid].BCFGR),\
                                                                  RISAF_REGZCFGR_SEC))
#define HAL_RIF_CLEAR_RISAF_SUBREGB_PRIV(Instance,regionid)     (SEC_CLEAR_BIT\
                                                                 ((((RISAF_TypeDef*)Instance)->REG[regionid].BCFGR),\
                                                                  RISAF_REGZCFGR_PRIV))
#define HAL_RIF_CLEAR_RISAF_SUBREGB_RDEN(Instance,regionid)     (SEC_CLEAR_BIT\
                                                                 ((((RISAF_TypeDef*)Instance)->REG[regionid].BCFGR),\
                                                                  RISAF_REGZCFGR_RDEN))
#define HAL_RIF_CLEAR_RISAF_SUBREGB_WREN(Instance,regionid)     (SEC_CLEAR_BIT\
                                                                 ((((RISAF_TypeDef*)Instance)->REG[regionid].BCFGR),\
                                                                  RISAF_REGZCFGR_WREN))
#define HAL_RIF_CLEAR_RISAF_SUBREGB_ENC(Instance,regionid)      (SEC_CLEAR_BIT\
                                                                 ((((RISAF_TypeDef*)Instance)->REG[regionid].BCFGR),\
                                                                  RISAF_REGZCFGR_ENC))
#define HAL_RIF_CLEAR_RISAF_SUBREGB_DCEN(Instance,regionid)     (SEC_CLEAR_BIT\
                                                                 ((((RISAF_TypeDef*)Instance)->REG[regionid].BNESTR),\
                                                                  RISAF_REGZNESTR_DCEN))

#define HAL_RIF_READ_RISAF_ACFGR(Instance,regionid)             (SEC_READ_REG\
                                                                 ((((RISAF_TypeDef*)Instance)->REG[regionid].ACFGR)))
#define HAL_RIF_READ_RISAF_ASTARTR(Instance,regionid)           (SEC_READ_REG\
                                                                 ((((RISAF_TypeDef*)Instance)->REG[regionid].ASTARTR)))
#define HAL_RIF_READ_RISAF_AENDR(Instance,regionid)             (SEC_READ_REG\
                                                                 ((((RISAF_TypeDef*)Instance)->REG[regionid].AENDR)))
#define HAL_RIF_READ_RISAF_ANESTR(Instance,regionid)            (SEC_READ_REG\
                                                                 ((((RISAF_TypeDef*)Instance)->REG[regionid].ANESTR)))
#define HAL_RIF_READ_RISAF_BCFGR(Instance,regionid)             (SEC_READ_REG\
                                                                 ((((RISAF_TypeDef*)Instance)->REG[regionid].BCFGR)))
#define HAL_RIF_READ_RISAF_BSTARTR(Instance,regionid)           (SEC_READ_REG\
                                                                 ((((RISAF_TypeDef*)Instance)->REG[regionid].BSTARTR)))
#define HAL_RIF_READ_RISAF_BENDR(Instance,regionid)             (SEC_READ_REG\
                                                                 ((((RISAF_TypeDef*)Instance)->REG[regionid].BENDR)))
#define HAL_RIF_READ_RISAF_BNESTR(Instance,regionid)            (SEC_READ_REG\
                                                                 ((((RISAF_TypeDef*)Instance)->REG[regionid].BNESTR)))

/* #define HAL_RIF_READ_RISAF_SUBREGA_DCCID(Instance,regionid)  (SEC_READ_BIT\
   ((((RISAF_TypeDef*)Instance)->REG[regionid].ANESTR),\
   RISAF_REGZNESTR_DCCID) >> RISAF_REGZNESTR_DCCID_Pos) */
#define HAL_RIF_READ_RISAF_SUBREGA_DCCID(Instance,regionid)     (SEC_READ_BIT\
                                                                 ((((RISAF_TypeDef*)Instance)->REG[regionid].ANESTR),\
                                                                  RISAF_REGZNESTR_DCCID))
#define HAL_RIF_IS_RISAF_SUBREGA_DCCID(Instance,regionid,cid)   (HAL_RIF_READ_RISAF_SUBREGA_DCCID\
                                                                 (Instance,regionid) == cid ? 1 : 0)
#define HAL_RIF_SET_RISAF_SUBREGA_DCCID(Instance,regionid,val)  (SEC_MODIFY_REG\
                                                                 ((((RISAF_TypeDef*)Instance)->REG[regionid].ANESTR),\
                                                                  RISAF_REGZNESTR_DCCID_Msk, val))
/* #define HAL_RIF_READ_RISAF_SUBREGB_DCCID(Instance,regionid)     (SEC_READ_BIT\
     ((((RISAF_TypeDef*)Instance)->REG[regionid].BNESTR),\
   RISAF_REGZNESTR_DCCID) >> RISAF_REGZNESTR_DCCID_Pos) */
#define HAL_RIF_READ_RISAF_SUBREGB_DCCID(Instance,regionid)     (SEC_READ_BIT\
                                                                 ((((RISAF_TypeDef*)Instance)->REG[regionid].BNESTR),\
                                                                  RISAF_REGZNESTR_DCCID))
#define HAL_RIF_IS_RISAF_SUBREGB_DCCID(Instance,regionid,cid)   (HAL_RIF_READ_RISAF_SUBREGB_DCCID\
                                                                 (Instance,regionid) == cid ? 1 : 0)
#define HAL_RIF_SET_RISAF_SUBREGB_DCCID(Instance,regionid,val)  (SEC_MODIFY_REG\
                                                                 ((((RISAF_TypeDef*)Instance)->REG[regionid].BNESTR),\
                                                                  RISAF_REGZNESTR_DCCID_Msk, val))

/* #define HAL_RIF_READ_RISAF_SUBREGA_SRCID(Instance,regionid)     (SEC_READ_BIT\
   ((((RISAF_TypeDef*)Instance)->REG[regionid].ACFGR),\
   RISAF_REGZCFGR_SRCID) >> RISAF_REGZCFGR_SRCID_Pos) */
#define HAL_RIF_READ_RISAF_SUBREGA_SRCID(Instance,regionid)     (SEC_READ_BIT\
                                                                 ((((RISAF_TypeDef*)Instance)->REG[regionid].ACFGR),\
                                                                  RISAF_REGZCFGR_SRCID))
#define HAL_RIF_IS_RISAF_SUBREGA_SRCID(Instance,regionid,cid)   (HAL_RIF__READ_RISAF_SUBREGA_SRCID\
                                                                 (Instance,regionid) == cid ? 1 : 0)
#define HAL_RIF_SET_RISAF_SUBREGA_SRCID(Instance,regionid,val)  (SEC_MODIFY_REG\
                                                                 ((((RISAF_TypeDef*)Instance)->REG[regionid].ACFGR),\
                                                                  RISAF_REGZCFGR_SRCID_Msk, val))
/* #define HAL_RIF_READ_RISAF_SUBREGB_SRCID(Instance,regionid)     (SEC_READ_BIT\
   ((((RISAF_TypeDef*)Instance)->REG[regionid].BCFGR),\
   RISAF_REGZCFGR_SRCID) >> RISAF_REGZCFGR_SRCID_Pos) */
#define HAL_RIF_READ_RISAF_SUBREGB_SRCID(Instance,regionid)     (SEC_READ_BIT\
                                                                 ((((RISAF_TypeDef*)Instance)->REG[regionid].BCFGR),\
                                                                  RISAF_REGZCFGR_SRCID))
#define HAL_RIF_IS_RISAF_SUBREGB_SRCID(Instance,regionid,cid)   (HAL_RIF__READ_RISAF_SUBREGB_SRCID\
                                                                 (Instance,regionid) == cid ? 1 : 0)
#define HAL_RIF_SET_RISAF_SUBREGB_SRCID(Instance,regionid,val)  (SEC_MODIFY_REG\
                                                                 ((((RISAF_TypeDef*)Instance)->REG[regionid].BCFGR),\
                                                                  RISAF_REGZCFGR_SRCID_Msk, val))

/* ENCRYPTION KEY */
#define HAL_RIF_SET_RISAF_KEYR(Instance,keyid,val)          (SEC_WRITE_REG\
                                                             ((((RISAF_TypeDef*)Instance)->KEYR[keyid]), val))

/* ILLEGAL ACCESS */
#define HAL_RIF_READ_RISAF_IASR(Instance)                   (SEC_READ_REG\
                                                             ((((RISAF_TypeDef*)Instance)->IASR)))
#define HAL_RIF_READ_RISAF_IAESR0(Instance)                 (SEC_READ_REG\
                                                             ((((RISAF_TypeDef*)Instance)->IAR[0].IAESR)))
#define HAL_RIF_READ_RISAF_IAESR1(Instance)                 (SEC_READ_REG\
                                                             ((((RISAF_TypeDef*)Instance)->IAR[1].IAESR)))
#define HAL_RIF_READ_RISAF_IADDR0(Instance)                 (SEC_READ_REG\
                                                             ((((RISAF_TypeDef*)Instance)->IAR[0].IADDR)))
#define HAL_RIF_READ_RISAF_IADDR1(Instance)                 (SEC_READ_REG\
                                                             ((((RISAF_TypeDef*)Instance)->IAR[1].IADDR)))

#define HAL_RIF_CLEAR_RISAF_IACR_CAEF(Instance)             (SEC_SET_BIT\
                                                             ((((RISAF_TypeDef*)Instance)->IACR), RISAF_IACR_CAEF))
#define HAL_RIF_CLEAR_RISAF_IACR_IAEF0(Instance)            (SEC_SET_BIT\
                                                             ((((RISAF_TypeDef*)Instance)->IACR), RISAF_IACR_IAEF0))
#define HAL_RIF_CLEAR_RISAF_IACR_IAEF1(Instance)            (SEC_SET_BIT\
                                                             ((((RISAF_TypeDef*)Instance)->IACR), RISAF_IACR_IAEF1))
#define HAL_RIF_CLEAR_RISAF_IACR(Instance)                  (SEC_SET_BIT\
                                                             ((((RISAF_TypeDef*)Instance)->IACR),\
                                                              RISAF_IACR_CAEF|RISAF_IACR_IAEF0|RISAF_IACR_IAEF1))

#define HAL_RIF_IS_RISAF_IASR_CAEF(Instance)                (SEC_READ_BIT\
                                                             ((((RISAF_TypeDef*)Instance)->IASR), RISAF_IASR_CAEF))
#define HAL_RIF_IS_RISAF_IASR_IAEF0(Instance)               (SEC_READ_BIT\
                                                             ((((RISAF_TypeDef*)Instance)->IASR), RISAF_IASR_IAEF0))
#define HAL_RIF_IS_RISAF_IASR_IAEF1(Instance)               (SEC_READ_BIT\
                                                             ((((RISAF_TypeDef*)Instance)->IASR), RISAF_IASR_IAEF1))
#define HAL_RIF_IS_RISAF_IAESR0_IAPRIV(Instance)            (SEC_READ_BIT\
                                                             ((((RISAF_TypeDef*)Instance)->IAR[0].IAESR),\
                                                              RISAF_IAESR_IAPRIV))
#define HAL_RIF_IS_RISAF_IAESR0_IASEC(Instance)             (SEC_READ_BIT\
                                                             ((((RISAF_TypeDef*)Instance)->IAR[0].IAESR),\
                                                              RISAF_IAESR_IASEC))
#define HAL_RIF_IS_RISAF_IAESR0_IANRW(Instance)             (SEC_READ_BIT\
                                                             ((((RISAF_TypeDef*)Instance)->IAR[0].IAESR),\
                                                              RISAF_IAESR_IANRW))
#define HAL_RIF_IS_RISAF_IAESR1_IAPRIV(Instance)            (SEC_READ_BIT\
                                                             ((((RISAF_TypeDef*)Instance)->IAR[1].IAESR),\
                                                              RISAF_IAESR_IAPRIV))
#define HAL_RIF_IS_RISAF_IAESR1_IASEC(Instance)             (SEC_READ_BIT\
                                                             ((((RISAF_TypeDef*)Instance)->IAR[1].IAESR),\
                                                              RISAF_IAESR_IASEC))
#define HAL_RIF_IS_RISAF_IAESR1_IANRW(Instance)             (SEC_READ_BIT\
                                                             ((((RISAF_TypeDef*)Instance)->IAR[1].IAESR),\
                                                              RISAF_IAESR_IANRW))

#define HAL_RIF_READ_RISAF_IAESR0_IACID(Instance)           (SEC_READ_BIT\
                                                             ((((RISAF_TypeDef*)Instance)->IAR[0].IAESR),\
                                                              RISAF_IAESR_IACID) >> RISAF_IAESR_IACID_Pos)
#define HAL_RIF_READ_RISAF_IAESR1_IACID(Instance)           (SEC_READ_BIT\
                                                             ((((RISAF_TypeDef*)Instance)->IAR[1].IAESR),\
                                                              RISAF_IAESR_IACID) >> RISAF_IAESR_IACID_Pos)

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */


#ifdef __cplusplus
}
#endif

#endif /* STM32MP2xx_HAL_RIF_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
